[{"model": "ver0.paper", "pk": 1, "fields": {"title": "Active appearance models for photorealistic visual speech synthesis", "abstract": "The perceived quality of a synthetic visual speech signal greatly depends on the smoothness of the presented visual articulators. This paper explains how concatenative visual speech synthesis systems can apply active appearance models to achieve a smooth and natural visual output speech. By modeling the visual speech contained in the system's speech database, a diversification between the synthesis of the shape and the texture of the talking head is feasible. This allows the system to accurately balance between the articulation strength of the visual articulators and the signal smoothness of the visual mode in order to optimize the synthesis. To improve the synthesis quality, an automatic database normalization strategy has been designed that removes variations from the database which are not related to speech production. As was verified by a perception experiment, this normalization strategy significantly improves the perceived signal quality.", "conference": 1, "authors": [1, 2, 3], "affiliations": [1, 2], "keys": [1, 2, 3, 4], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/mattheyses10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 2, "fields": {"title": "Turn taking-based conversation detection by using DOA estimation", "abstract": "We propose a new method that detects conversation groups when multi-conversation groups exist simultaneously. The proposed method uses hands-free microphone arrays without wearable microphones. It has two main features: (a) We integrate a conventional turn taking-based conversation detection method with Direction of Arrival (DOA) estimation-based Voice Activity Detection (VAD). (b) The proposed method estimates the number of speakers for DOA estimation-based VAD by using turn taking rules. Experimental results indicate that the performance of the proposed method with only microphone arrays setup in rooms is comparable to that of the conventional methods with wearable microphones.", "conference": 1, "authors": [4, 5, 6], "affiliations": [], "keys": [5, 6, 7, 8, 9, 10, 11, 12, 13, 14], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/kawaguchi10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 3, "fields": {"title": "Statistical multi-stream modeling of real-time MRI articulatory speech data", "abstract": "This paper investigates different statistical modeling frameworks for articulatory speech data obtained using real-time (RT) magnetic resonance imaging (MRI). To quantitatively capture the spatio-temporal shaping process of the human vocal tract during speech production a multi-dimensional stream of image features is derived from the MRI recordings. The features are closely related, though not identical, to the tract variables commonly defined in the articulatory phonology theory. The modeling of the shaping process aims at decomposing the articulatory data streams into primitives by segmentation, and the segmentation task is carried out using vector quantizers, Gaussian Mixture Models, Hidden Markov Models, and a coupled Hidden Markov Model. We evaluate the performance of the different segmentation schemes qualitatively with the help of a well understood data set which was used in a earlier study of inter-articulatory timing phenomena of American English nasal sounds.", "conference": 1, "authors": [7, 8, 9, 10], "affiliations": [3], "keys": [15, 16, 17, 18, 19, 20], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/bresch10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 4, "fields": {"title": "Estimating noise from noisy speech features with a monte carlo variant of the expectation maximization algorithm", "abstract": "In this work, we derive a Monte Carlo expectation maximization algorithm for estimating noise from a noisy utterance. In contrast to earlier approaches, where the distribution of noise was estimated based on a vector Taylor series expansion, we use a combination of importance sampling and Parzen-window density estimation to numerically approximate the occurring integrals with the Monte Carlo method. Experimental results show that the proposed algorithm has superior convergence properties, compared to previous implementations of the EM algorithm. Its application to speech feature enhancement reduced the word error rate by over 30%, on a phone number recognition task recorded in a (real) noisy car environment.", "conference": 1, "authors": [11, 12], "affiliations": [4, 5, 6], "keys": [21, 22, 23, 24], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/faubel10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 5, "fields": {"title": "Floor holder detection and end of speaker turn prediction in meetings", "abstract": "We propose a novel fully automatic framework to detect which meeting participant is currently holding the conversational floor and when the current speaker turn is going to finish. Two sets of experiments were conducted on a large collection of multiparty conversations: the AMI meeting corpus. Unsupervised speaker turn detection was performed by post-processing the speaker diarization and the speech activity detection outputs. A supervised end-of-speaker-turn prediction framework, based on Dynamic Bayesian Networks and automatically extracted multimodal features (related to prosody, overlapping speech, and visual motion), was also investigated. These novel approaches resulted in good floor holder detection rates (13.2% Floor Error Rate), attaining state of the art end-of-speaker-turn prediction performances.", "conference": 1, "authors": [13, 14, 15], "affiliations": [7, 8], "keys": [25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/dielmann10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 6, "fields": {"title": "Automatic speech recognition of multiple accented English data", "abstract": "Accent variability is an important factor in speech that can significantly degrade automatic speech recognition performance. We investigate the effect of multiple accents on an English broadcast news recognition system. A multi-accented English corpus is used for the task, including broadcast news segments from 6 different geographic regions: US, Great Britain, Australia, North Africa, Middle East and India. There is significant performance degradation of a baseline system trained on only US data when confronted with shows from other regions. The results improve significantly when data from all the regions are included for accent-independent acoustic model training. Further improvements are achieved when MAP-adapted accent-dependent models are used in conjunction with a GMM accent classifier.", "conference": 1, "authors": [16, 17, 18], "affiliations": [9, 10], "keys": [24, 36, 37, 38, 39, 40], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/vergyri10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 7, "fields": {"title": "Approaching human listener accuracy with modern speaker verification", "abstract": "Being able to recognize people from their voice is a natural ability that we take for granted. Recent advances have shown significant improvement in automatic speaker recognition performance. Besides being able to process large amount of data in a fraction of time required by human, automatic systems are now able to deal with diverse channel effects. The goal of this paper is to examine how state-of-the-art automatic system performs in comparison with human listeners, and to investigate the strategy for human-assisted form of automatic speaker recognition, which is useful in forensic investigation. We set up an experimental protocol using data from the NIST SRE 2008 core set. A total of 36 listeners have participated in the listening experiments from three sites, namely Australia, Finland and Singapore. State-of-the-art automatic system achieved 20% error rate, whereas fusion of human listeners achieved 22%.", "conference": 1, "authors": [19, 20, 21, 22, 23, 24], "affiliations": [11, 12], "keys": [41, 42, 43], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/hautamaki10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 8, "fields": {"title": "Autoregressive clustering for HMM speech synthesis", "abstract": "The autoregressive HMM has been shown to provide efficient parameter estimation and high-quality synthesis, but in previous experiments decision trees derived from a non-autoregressive system were used. In this paper we investigate the use of autoregressive clustering for autoregressive HMM-based speech synthesis. We describe decision tree clustering for the autoregressive HMM and highlight differences to the standard clustering procedure. Subjective listening evaluation results suggest that autoregressive clustering improves the naturalness of the resulting speech. We find that the standard minimum description length (MDL) criterion for selecting model complexity is inappropriate for the autoregressive HMM. Investigating the effect of model complexity on naturalness, we find that a large degree of overfitting is tolerated without a substantial decrease in naturalness.", "conference": 1, "authors": [25, 26], "affiliations": [13], "keys": [44, 45, 46, 47, 48, 49, 50, 51], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/shannon10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 9, "fields": {"title": "Exploiting variety-dependent phones in portuguese variety identification applied to broadcast news transcription", "abstract": "This paper presents a Variety IDentification (VID) approach and its application to broadcast news transcription for Portuguese. The phonotactic VID system, based on Phone Recognition and Language Modelling, focuses on a single tokenizer that combines distinctive knowledge about differences between the target varieties. This knowledge is introduced into a Multi-Layer Perceptron phone recognizer by training mono-phone models for two varieties as contrasting phone-like classes. Significant improvements in terms of identification rate were achieved compared to conventional single and fused phonotactic and acoustic systems. The VID system is used to select data to automatically train variety-specific acoustic models for broadcast news transcription. The impact of the selection is analyzed and variety-specific recognition is shown to improve results by up to 13% compared to a standard variety baseline.", "conference": 1, "authors": [27, 28, 29, 30], "affiliations": [14, 15, 16, 17], "keys": [52, 2, 53, 54], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2010/koller10_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 10, "fields": {"title": "A pointwise approach to pronunciation estimation for a TTS front-end", "abstract": "In this paper, we propose a pointwise approach to the Japanese TTS front-end. In this approach, phoneme sequence estimation of sentences is decomposed into two tasks: word segmentation of the input sentence and phoneme estimation of each word. Then these two tasks are solved by pointwise classifiers without referring to the neighboring classification results. In contrast to existing sequence-based methods, an n-gram model based on sequences of word-phoneme pairs for example, this framework enables us to use various language resources such as sentences in which only a few words are annotated, or an unsegmented list of compound words, among others. In the experiments, we compared a joint tri-gram model with the combination of a pointwise word segmenter and a pointwise phoneme sequence estimator. The results showed that our framework successfully enables a TTS front-end to refer to a partially annotated corpus and/or a word sequence list annotated with phoneme sequences to realize a far larger improvement in accuracy.", "conference": 2, "authors": [31, 32], "affiliations": [18], "keys": [55], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/mori11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 11, "fields": {"title": "Spoken document confidence estimation using contextual coherence", "abstract": "Selecting well-recognized transcripts is critical if information retrieval systems are to extract business intelligence from massive spoken document databases. To achieve this goal, we target spoken document confidence measures that represent the recognition rates of each document. We focus on the incoherent word occurrences over several utterances in ill-recognized transcripts of spoken documents. The proposed method uses contextual coherence as a measure of spoken document confidence. The contextual coherence is formulated as the mean of pointwise mutual information (PMI). We also propose a smoothing method of PMI, which deals with the data sparseness problem. Compared to the conventional method, our smoothing technique offers improved correlation coefficients between spoken document confidence scores and recognition rates from 0.573 to 0.672. Moreover, an even higher correlation coefficient, 0.710, is achieved by combining the contextual-based and decoder-based confidence measures.", "conference": 2, "authors": [33, 34, 35, 36, 37, 38], "affiliations": [], "keys": [56, 24, 57, 2, 58, 59, 60, 61], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/asami11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 12, "fields": {"title": "Maximum likelihood i-vector space using PCA for speaker verification", "abstract": "This paper proposes a new approach to training the i-vector space using a variant of PCA with the Baum-Welch statistics for speaker verification. In eigenvoice the rank of variability space is bounded by the number of training speakers, so a variant of the probabilistic PCA approach is introduced for estimating the parameters. But this constraint doesn't exist in i-vector model because the number of utterances is much bigger than the rank of total variability space. We adopt the EM algorithm for PCA with the statistics to train the total variability space, and the maximum likelihood criterion is used. After WCCN, the cosine similarity scoring is used for decision. These two total variability spaces will be fused at feature-level and score-level. The experiments have been run on the NIST SRE 2008 data, and the results show that the performances in two total variability spaces are comparable. The performance can be improved obviously after feature fusion and score fusion.", "conference": 2, "authors": [39, 40], "affiliations": [19, 20, 21], "keys": [62, 63, 41, 64, 65, 66, 67, 42, 43], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/lei11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 13, "fields": {"title": "A rapid adaptation algorithm for tracking highly non-stationary noises based on Bayesian inference for on-line spectral change point detection", "abstract": "This paper presents an innovative rapid adaptation technique for tracking highly non-stationary acoustic noises. The novelty of this technique is that it can detect the acoustic change points from the spectral characteristics of the observed speech signal in rapidly changing non-stationary acoustic environments. The proposed innovative noise tracking technique will be very suitable for joint additive and channel distortions compensation (JAC) for on-line automatic speech recognition (ASR). The Bayesian on-line change point detection (BOCPD) approach is used to implement this technique. The proposed algorithm is tested using highly non-stationary noisy speech samples from the Aurora2 speech database. Significant improvement in minimizing the delay in adaptation to new acoustic conditions is obtained for highly nonstationary noises compared to the most popular baseline noise tracking algorithm MCRA and its derivatives.", "conference": 2, "authors": [41, 42, 43], "affiliations": [22], "keys": [68, 69, 70, 71, 72, 73, 74, 7, 75, 76, 77, 78, 79, 80, 81, 82, 83], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/chowdhury11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 14, "fields": {"title": "Phrasal prominences do not need pitch movements: postfocal phrasal heads in Italian", "abstract": "Informationally Given phrases following an instance of focus are generally realized in a compressed pitch range and are generally assumed to lack prosodic prominences. In this paper, we address the question of the metrical representation of postfocal constituents in Tuscan Italian. The results of a production experiment show that, despite their being realized with a low and flat F0 contour, postfocal constituents are not extrametrical, but are phrased and assigned phrasal metrical prominences of phrasal level. The impact of our results on the prosodic representation of Italian and on the information structure-prosody interface are discussed.", "conference": 2, "authors": [44, 45], "affiliations": [23], "keys": [], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/bocci11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 15, "fields": {"title": "Validating a second language perception model for classroom context - a longitudinal study within the perceptual assimilation model", "abstract": "The present study verified whether adult listeners retain the ability to improve non-native speech perception and if it can be significantly enhanced in the formal context, a very impoverished context with respect to the natural one. We tested (i) whether perceptual learning is possible for adults in a classroom context during focused phonetic lessons, and (ii) whether it follows the pattern predicted for natural acquisition by the PAM-L2 [1]. The results showed that adult listeners are still able to improve foreign sound perception and this ability seems to occur also in formal contexts in line with the PAM-L2 predictions.", "conference": 2, "authors": [46, 47], "affiliations": [24], "keys": [1, 84, 85, 86, 87], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/sisinni11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 16, "fields": {"title": "Phone impact based speech transmission technique for reliable speech recognition in poor wireless network conditions", "abstract": "This paper presents a preliminary study on an effective differentiable network service technique to achieve improved speech recognition under severely poor wireless channel conditions, by leveraging multiple priority levels applied to speech classes. Each speech class is assigned a different priority level based on its level of impact on speech recognition performance. Based on their priority level, frames of each speech class are given distinct levels of network quality of service (QoS) to satisfy the delay requirement and enable speech recognition at the receiver. This proposed Phone Impact (PI) based priority class is compared to the Voiced/Unvoiced (VU) based priority class in this study. The experimental results prove that the proposed scheme is effective at providing wireless network service for robust speech recognition under poor channel conditions, showing up to 2.67 dB and 5.93 dB lower Signal to Noise Ratio (SNR) operating regions compared to the VU based and plain protocols respectively. The PI based method also shows acceptable WERs at lower SNRs where VU and plain systems significantly degrade in speech recognition performance in case of retry limit of 6.", "conference": 2, "authors": [48, 49, 50, 51, 52, 53], "affiliations": [25], "keys": [88, 89, 24, 2, 90, 91, 92, 93], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/taufique11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 17, "fields": {"title": "Evaluation of i-vector speaker recognition systems for forensic application", "abstract": "This paper contributes a study on i-vector based speaker recognition systems and their application to forensics. The sensitivity of i-vector based speaker recognition is analyzed with respect to the effects of speech duration. This approach is motivated by the potentially limited speech available in a recording for a forensic case. In this context, the classification performance and calibration costs of the i-vector system are analyzed along with the role of normalization in the cosine kernel. Evaluated on the NIST SRE-2010 dataset, results highlight that normalization of the cosine kernel provided improved performance across all speech durations compared to the use of an unnormalized kernel. The normalized kernel was also found to play an important role in reducing miscalibration costs and providing well-calibrated likelihood ratios with limited speech duration.", "conference": 2, "authors": [54, 55, 56], "affiliations": [26], "keys": [94, 95, 41, 42, 96, 66, 97, 43, 98, 99], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2011/mandasari11_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 18, "fields": {"title": "Real-time visualization of English pronunciation on an IPA chart based on articulatory feature extraction", "abstract": "In recent years, Computer Assisted Pronunciation Technology (CAPT) systems have been developed that can help Japanese learners to study foreign languages. We have been developing a pronunciation training system to evaluate and correct learner's pronunciation by extracting articulatory-features (AFs). In this paper, we propose a novel pronunciation training system that can plot the place and manner of articulation of learner's pronunciation on an International Phonetic Alphabet (IPA) chart in real time. First, the proposed system converts input speech into AF-sequences by using multi-layer neural networks (MLNs). Then, the AF-sequences are converted into x-y coordinates and plotted on an IPA chart to show his/her articulation in real time. Lastly, we investigate plotting accuracies on the IPA chart through experimental evaluation.", "conference": 3, "authors": [57, 58, 59, 60, 61], "affiliations": [27, 28], "keys": [100, 101, 102, 103, 104, 105, 106, 107], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2012/iribe12_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 19, "fields": {"title": "Enhancing vocal tract length normalization with elastic registration for automatic speech recognition", "abstract": "Vocal tract length normalization (VTLN) is commonly applied utterance-wise with a warping function which makes the assumption of a linear dependence between the vocal tract length and the location of the formants. In this work we propose a data-driven method for enhancing the performance of systems that already use standard VTLN. The method is based on elastic registration to estimate optimal nonparametric transformations to further reduce inter-speaker variabilities. Results show that the proposed method can increase the performance of monophone systems such that it reaches that of a triphone system.", "conference": 3, "authors": [62, 63], "affiliations": [29], "keys": [108, 109, 110, 111, 112], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2012/muller12_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 20, "fields": {"title": "Overlapped speech detection in meeting using cross-channel spectral subtraction and spectrum similarity", "abstract": "We propose an overlapped speech detection method for speech recognition and speaker diarization of meetings, where each speaker wears a lapel microphone. Two novel features are utilized as inputs for a GMM-based detector. One is speech power after cross-channel spectral subtraction which reduces the power from the other speakers. The other is an amplitude spectral cosine correlation coefficient which effectively extracts the correlation of spectral components in a rather quiet condition. We evaluated our method using a meeting speech corpus of four persons. The accuracy of our proposed method, 74.1%, was significantly better than that of the conventional method, 67.0%, which uses raw speech power and power spectral Pearson's correlation coefficient.", "conference": 3, "authors": [64, 65, 66, 67], "affiliations": [30, 31], "keys": [113, 7, 114, 38, 115, 116], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2012/yokoyama12_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 21, "fields": {"title": "Hidden Markov convolutive mixture model for pitch contour analysis of speech", "abstract": "This paper proposes a statistical model of speech F0 contours, which is based on the discrete-time version of the Fujisaki model. Our motivation for formulating this model is incorporating F0 contours into various statistical speech processing problems. In this paper, we describe the formulation of the model and quantitatively evaluates the performance of the model through Fujisaki-model parameter estimations from real speech F0 contours. Compared with another speech F0 model we have proposed, the present model prefer fitting observed F0 contours because the previous model is based on a squared error criterion in the Fujisaki-model commands domain and the present model is in the F0 contours domain.", "conference": 3, "authors": [68, 69, 70, 71], "affiliations": [32, 33], "keys": [117, 118, 119, 120, 121, 122], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2012/yoshizato12_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 22, "fields": {"title": "Vowels produced by sliding three-tube model with different lengths", "abstract": "The sliding three-tube (S3T) model, based on Fant's acoustic theory and proposed in our previous studies, has a simple structure, enabling it to produce human-like vowels useful for education in acoustics and speech science. In this study, we changed the size of the S3T model and combined it with sound sources with different fundamental frequencies. We confirmed that the models could produce vowels of different speaker types. We were able to retain good vowel quality for a perceptual study when we simultaneously shortened vocal-tract length and increased fundamental frequency. We also discussed the models in a new way, comparing children's and adults' vowels, especially for educational purposes.", "conference": 3, "authors": [72], "affiliations": [34], "keys": [117, 123, 124, 125, 126, 127, 128, 129], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2012/arai12_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 23, "fields": {"title": "A robust unsupervised arousal rating framework using prosody with cross-corpora evaluation", "abstract": "This paper presents an unsupervised method for producing a bounded rating of affective arousal from speech. One of the major challenges in such behavioral signal classification is the design of methods that generalize well across domains and datasets. We propose a framework that provides robustness across databases by: selecting coherent features based on empirical and theoretical evidence, fusing activation confidences from multiple features, and effectively weighting the soft-labels without knowing the true labels. Spearman's rank-correlation (and binary classification accuracy) on four arousal databases are: 0.62 (73%), 0.77 (86%), 0.70 (82%), and 0.65 (73%).", "conference": 3, "authors": [73, 74, 10], "affiliations": [35], "keys": [130, 131, 132, 133, 134, 135, 136, 137, 87, 138], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2012/bone12_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 24, "fields": {"title": "Model-based approaches to adaptive training in reverberant environments", "abstract": "Adaptive training is a powerful approach for building speech recognition systems using non-homogeneous data. This work presents an extension of model-based adaptive training to handle reverberant environments. The recently proposed Reverberant VTS-Joint (RVTSJ) adaptation is used to factor out unwanted additive and reverberant noise variations in multiconditional training data, yielding a canonical model neutral to noise conditions. An maximum likelihood estimation of the canonical model parameters is described. An initialisation scheme that uses the VTS-based adaptive training to initialise the model parameters is also presented. Experiments are conducted on a reverberant simulated AURORA4 task.", "conference": 3, "authors": [75, 76], "affiliations": [36, 37], "keys": [70, 139, 140, 141, 142, 143, 144, 145], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2012/wang12g_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 25, "fields": {"title": "The influence of F0 contour continuity on prominence perception", "abstract": "The presented study concerns the influence of the syllabic structure on perceived prominence. We examined how gaps in the F0 contour due to unvoiced consonants affect prominence perception, given that such gaps can either be filled or blinded out by listeners. For this purpose we created a stimulus set of real disyllabic words which differed in the quantity of the vowel of the accented syllable nucleus and the types of subsequent intervocalic consonant(s). Results include, inter alia, that stimuli with unvoiced gaps in the F0 contour are indeed perceived as less prominent. The prominence reduction is smaller for monotonous stimuli than for stimuli with F0 excursions across the accented syllable. Moreover, in combination with F0 excursions, it also mattered whether F0 had to be interpolated or extrapolated, and whether or not the gap included a fricative sound. The results support both the filling-in and blinding-out of F0 gaps, which fits in well with earlier experiments on the production and perception of pitch.", "conference": 4, "authors": [77, 78], "affiliations": [38], "keys": [146, 147, 148, 149, 150, 151], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/mixdorff13_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 26, "fields": {"title": "The edinburgh speech production facility doubletalk corpus", "abstract": "The DoubleTalk articulatory corpus was collected at the Edinburgh Speech Production Facility (ESPF) using two synchronized Carstens AG500 electromagnetic articulometers. The first release of the corpus comprises orthographic transcriptions aligned at phrasal level to EMA and audio data for each of 6 mixed-dialect speaker pairs. It is available from the ESPF online archive. A variety of tasks were used to elicit a wide range of speech styles, including monologue (a modified Comma Gets a Cure and spontaneous story-telling), structured spontaneous dialogue (Map Task and Diapix), a wordlist task, a memory-recall task, and a shadowing task. In this session we will demo the corpus with various examples.", "conference": 4, "authors": [79, 80, 81, 82, 83, 84], "affiliations": [39, 40], "keys": [152, 2, 153, 154, 155, 156, 157], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/scobbie13_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 27, "fields": {"title": "Vowel and prosodic factor dependent variations of vocal-tract length", "abstract": "We have measured total vocal-tract (VT) length, lip-tube length and glottal height during vowels on X-ray film data of short French utterances. VT midpoints are determined by progressively fitting circles along the VT-length from the glottis to lip opening. The VT-length is obtained by summing up the distance between adjacent midpoints. Lip-tube length is defined as the distance between the incisors and the lip opening along the midline. Results show that the range of VT-length variation is 3.2cm with the average VTlength of 16.4cm. The cause of this large range appears to be the combination of the vowel dependent VT-length and prosodic position that influences on the glottal height. For example, during a vowel at sentence final position, glottis goes down with falling intonation or up with rising intonation corresponding to, respectively, VT lengthening or shortening. The lip-tube lengths are little affected by prosodic position and exhibit a clear vowel dependency. The prosodic influences manifested on the glottal height are not compensated but rather expanded in the VT-length, yet maintaining the characteristic vowel-dependency. This suggests an underlying mechanism to maintain a uniform stretching/compression of VTlength, which tends to hold the phonetic identity of a vowel under large VT-length changes.", "conference": 4, "authors": [85, 86], "affiliations": [41], "keys": [158, 15, 159, 17], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/maeda13_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 28, "fields": {"title": "Identifying consonantal tasks via measures of tongue shaping: a real-time MRI investigation of the production of vocalized syllabic /l/ in American English", "abstract": "Liquids are unique in their ability to occupy syllable onset, nucleus, and coda positions in American English, as well as the fact that they are composed of two lingual gestures. Upon inspection of /l/ in syllable nucleus and coda positions using real-time MRI, it appears that the tongue tip constriction we might expect for /l/ is often not present, a phenomenon called /l/-vocalization. However, it is not merely the case that the consonantal gesture of /l/ is completely lost in these syllable positions, leaving behind a simple vocalic configuration. Though there is often no raising of the tongue tip in an attempt to make contact with the alveolar ridge, the /l/ exhibits complex tongue shaping involving curling in the region of the tongue blade. The result is a lowered tongue blade relative to the tongue tip and dorsum. This shaping is captured through measures of Gaussian curvature at evenly spaced points along the tongue. The results indicate that /l/-vocalization in the syllable rhyme does not involve a complete loss of the consonantal nature of the lateral, but rather a modification of its realization.", "conference": 4, "authors": [87, 88], "affiliations": [3], "keys": [160, 161, 19, 162, 163], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/smith13c_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 29, "fields": {"title": "The organ stop “vox humana” as a model for a vowel synthesiser", "abstract": "In mechanical speech synthesis reed pipes were mainly used for the generation of the voice. The organ stop \"vox humana\" played a central role for this concept. Historical documents report that the \"vox humana\" sounded like human vowels. In this study tones of four different \"voces humanae\" were recorded to investigate the similarity to human vowels. The acoustical and perceptual analysis revealed that some though not all tones show a high similarity to selected vowels.", "conference": 4, "authors": [89, 90], "affiliations": [4], "keys": [164, 165, 166, 129], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/brackhane13_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 30, "fields": {"title": "Artificial bandwidth extension based on regularized piecewise linear mapping with discriminative region weighting and long-Span features", "abstract": "Artificial Bandwidth Extension (ABE) has been introduced to improve perceived speech quality and intelligibility of narrow-band telephone speech. Most of the existing algorithms divided ABE into 2 sub-problems, namely extension of the excitation signal and that of the spectral envelope. In this paper, we propose a new method for spectral envelope extension based on REgularized piecewise linear mapping with DIscriminative region weighting And Longspan features (REDIAL). REDIAL is a revised version of SPLICE, a well-known method for speech enhancement. In REDIAL, however, discriminative model is introduced for space division step of the original SPLICE. The proposed REDIAL-based method approximates non-linear transformation from narrowband features to their wideband counterpart by a summation of piecewise linear transformations. The proposed method was compared with the widely used GMM-based method, through objective and subjective evaluations in both speaker-dependent and speaker-independent conditions. Both evaluations showed that the proposed method significantly outperforms the conventional GMM-based method.", "conference": 4, "authors": [91, 92, 93, 94], "affiliations": [], "keys": [167, 168, 169, 170, 171, 38, 172, 173], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/duy13_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 31, "fields": {"title": "An investigation of vowel epenthesis in Chinese learners' production of German consonants", "abstract": "The present study investigates the influence of phonetic factors on the frequency of vowel epenthesis in the German speech of Chinese learners. The subjects were intermediate learners of German who entered Germany within five months of their study. Descriptive statistics were performed on the data collected from reading tasks, and phonetic analysis was provided to explain the phenomenon of epenthesis. In the main experiment, eighteen Chinese students were recruited to read 50 phonetically rich sentences with various sentence modes after one month residence in Germany. Results indicate that these learners employed the epenthesis strategy more or less in producing consonant codas and consonant onset clusters in German. An investigation in the frequency of epenthesis in relation to various factors demonstrates that consonant cluster length, L1 transfer, markedness, sonority, and articulatory timing influence the occurrences of epenthesis simultaneously. An additional experiment was conducted after a time span of three months, ten of these subjects were requested to read the same text, the result shows that the amount of epenthesis decreases with the increase of the length of residence and German language learning experience. These findings might shed some light on the acquisition process of consonant codas in foreign languages.", "conference": 4, "authors": [95, 96], "affiliations": [42, 43], "keys": [174, 175, 176], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/ding13_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 32, "fields": {"title": "Text-to-speech inspired duration modeling for improved whole-word acoustic models", "abstract": "In the construction of whole-word acoustic models, we have previously demonstrated substantial gains by using MAP estimation to introduce a simple prior model of phonetic timing. Based solely on the word's phonetic (dictionary) pronunciation, this simple model included no information about the individual durations of constituent phones. However, the problem of modeling segmental duration has long been studied in the text-to-speech (TTS) community. We draw upon this work to develop a classification and regression tree (CART) approach for constructing prior models of phonetic timing which considers factors such as syllable stress, syllable position, adjacent phone class and voicing. This improved prior model closes 33% of the gap in keyword spotting performance between highly supervised whole-word models and those estimated without any examples.", "conference": 4, "authors": [97, 98, 99], "affiliations": [44], "keys": [117, 1, 55, 177, 36, 178, 179, 180, 181, 182, 183], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2013/kintzley13_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 33, "fields": {"title": "Distributed asynchronous optimization of convolutional neural networks", "abstract": "Recently, deep Convolutional Neural Networks have been shown to outperform Deep Neural Networks for acoustic modelling, producing state-of-the-art accuracy in speech recognition tasks. Convolutional models provide increased model robustness through the usage of pooling invariance and weight sharing across spectrum and time. However, training convolutional models is a very computationally expensive optimization procedure, especially when combined with large training corpora. In this paper, we present a novel algorithm for scalable training of deep Convolutional Neural Networks across multiple GPUs. Our distributed asynchronous stochastic gradient descent algorithm incorporates sparse gradients, momentum and gradient decay to accelerate the training of these networks. Our approach is stable, neither requiring warm-starting or excessively large minibatches. Our proposed approach enables convolutional models to be efficiently trained across multiple GPUs, enabling a model to be scaled asynchronously across 5 GPU workers with ˜68% efficiency.", "conference": 5, "authors": [100, 101], "affiliations": [45, 46], "keys": [184, 185, 186, 187], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/chan14_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 34, "fields": {"title": "Combination of multilingual and semi-supervised training for under-resourced languages", "abstract": "Multilingual training of neural networks for ASR is widely studied these days. It has been shown that languages with little training data can benefit largely from the multilingual resources for training. The use of unlabeled data for the neural network training in semi-supervised manner has also improved the ASR system performance. Here, the combination of both methods is presented. First, multilingual training is performed to obtain an ASR system to automatically transcribe the unlabeled data. Then, the automatically transcribed data are added. Two neural networks are trained — one from random initialization and one adapted from multilingual network — to evaluate the effect of multilingual training under presence of larger amount of training data. Further, the CMLLR transform is applied in the middle of the stacked Bottle-Neck neural network structure. As the CMLLR rotates the features to better fit given model, we evaluated whether it is better to adapt the existing NN on the CMLLR features or if it is better to train it from random initialization. The last step in our training procedure is the fine-tuning on the original data.", "conference": 5, "authors": [102, 103], "affiliations": [47, 48], "keys": [188, 72, 189, 190, 191, 192, 143, 193, 194, 195, 196, 197, 198, 199, 200], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/grezl14_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 35, "fields": {"title": "On the selection of the impulse responses for distant-speech recognition based on contaminated speech training", "abstract": "Distant-speech recognition represents a technology of fundamental importance for future development of assistive applications characterized by flexible and unobtrusive interaction in home environments. State-of-the-art speech recognition still exhibits lack of robustness, and an unacceptable performance variability, due to environmental noise, reverberation effects, and speaker position. In the past, multi-condition training and contamination methods were explored to reduce the mismatch between training and test conditions. However, the performance evaluation can be biased by factors as limited number of positions of speaker and microphones, adopted set of impulse responses, vocabulary and grammars defining the recognition task. The purpose of this paper is to investigate in more detail some critical aspects that characterize such experimental context. To this purpose, our work addressed a microphone network distributed over different rooms of an apartment and a related set of speaker-microphone pairs leading to a very large set of impulse responses. Besides simulations, the experiments also tackled real speech interactions. The performance evaluation was based on a phone-loop task, in order to minimize the influence of linguistic constraints. The experimental results show how less critical is an accurate selection of impulse responses, if compared to other factors as the signal-to-noise ratio introduced by additive background noise.", "conference": 5, "authors": [104, 105], "affiliations": [49], "keys": [201, 24, 136, 22, 202], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/ravanelli14_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 36, "fields": {"title": "Intrinsic spectral analysis based on temporal context features for query-by-example spoken term detection", "abstract": "We investigate the use of intrinsic spectral analysis (ISA) for query-by-example spoken term detection (QbE-STD). In the task, spoken queries and test utterances in an audio archive are converted to ISA features, and dynamic time warping is applied to match the feature sequence in each query with those in test utterances. Motivated by manifold learning, ISA has been proposed to recover from untranscribed utterances a set of nonlinear basis functions for the speech manifold, and shown with improved phonetic separability and inherent speaker independence. Due to the coarticulation phenomenon in speech, we propose to use temporal context information to obtain the ISA features. Gaussian posteriorgram, as an efficient acoustic representation usually used in QbE-STD, is considered a baseline feature. Experimental results on the TIMIT speech corpus show that the ISA features can provide a relative 13.5% improvement in mean average precision over the baseline features, when the temporal context information is used.", "conference": 5, "authors": [106, 107, 108, 23, 24], "affiliations": [50], "keys": [203, 204, 205, 206, 207, 58, 208, 209, 210, 211], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/yang14c_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 37, "fields": {"title": "Crowdee: mobile crowdsourcing micro-task platform for celebrating the diversity of languages", "abstract": "This paper introduces a novel crowdsourcing platform provided to the community. The platform operates on mobile devices and makes data generation and labeling scenarios available for many related research tracks potentially covering also small and underrepresented languages. Besides the versatile ways for commencing studies using the platform, also active research on crowdsourcing itself becomes feasible. With special focus on speech- and video recordings, the mobility and scalability of the platform is expected to stimulate and foster data-driven studies and insights throughout the community.", "conference": 5, "authors": [109, 110, 111, 112, 113], "affiliations": [51, 52], "keys": [212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/naderi14_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 38, "fields": {"title": "Spectral tilt modelling with GMMs for intelligibility enhancement of narrowband telephone speech", "abstract": "In mobile communications, post-processing methods are used to improve the intelligibility of speech in adverse background noise conditions. In this study, post-processing based on modelling the Lombard effect is investigated. The study focuses on comparing different spectral envelope estimation methods together with Gaussian mixture modelling in order to change the spectral tilt of speech in a post-processing algorithm. Six spectral envelope estimation methods are compared using objective distortion measures as well as subjective word-error rate and quality tests in different near-end noise conditions. Results show that one of the envelope estimation methods, stabilised weighted linear prediction, yielded statistically significant improvement in intelligibility over unprocessed speech.", "conference": 5, "authors": [114, 115, 116, 117, 118, 119], "affiliations": [53, 54], "keys": [224, 225, 226, 227, 228, 229, 230], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/jokinen14b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 39, "fields": {"title": "A low complexity model adaptation approach involving sparse coding over multiple dictionaries", "abstract": "The work presented in this paper describes a novel on-line adaptation approach for extremely low adaptation data scenario. The proposed approach extends a similar redundant dictionary based approach reported recently in literature. In this work, the orthogonal matching pursuit (OMP) algorithm is used for bases selection instead of the matching pursuit (MP). This helps in avoiding the selection of an atom more than once. Furthermore, this work also explores the use of cluster-specific eigenvoices to capture local acoustic details unlike the conventional eigenvoices technique. These approaches are then combined to reduce the number of weight parameters being estimated for deriving adapted model. Towards this purpose, separate sparse coding of the test data is performed over a set of dictionaries. Those sparse coded supervectors are then scaled and used as the Gaussian mean parameter in the adapted model. Consequently, only a few scaling factors are needed to be estimated. Such a reduction in number of parameters is highly desirable for on-line applications where the latency is a major factor.", "conference": 5, "authors": [120, 121], "affiliations": [55], "keys": [231, 232, 233, 234, 235, 236, 237, 40, 238], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/shahnawazuddin14_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 40, "fields": {"title": "English consonant confusions by Greek listeners in quiet and noise and the role of phonological short-term memory", "abstract": "This study investigated English consonant identification by Greek listeners and the role of phonological short-term memory (PSTM) in listeners' identification ability. Twenty Greek university students who had received formal instruction in English identified 24 English consonants (embedded in VCV syllables) presented in quiet and in two noise types, a competing talker at a signal-to-noise ratio (SNR) of -6dB and an 8-speaker babble at an SNR of -2dB. Participants' PSTM was assessed via a serial non-word recognition task in Greek. The results showed that identification scores in quiet were significantly higher than in noise. There was no difference in scores between the two noise conditions. PSTM correlated with English consonant identification in quiet and in the two types of noise; listeners with greater PSTM capacity were also better in identifying English consonants in quiet and noise, a finding that extends previous research in quiet to L2 perception in adverse listening conditions. English consonant confusion patterns are interpreted as caused by a combination of first-language interference (at both the phonetic and phonological levels) and spectral/articulatory factors.", "conference": 5, "authors": [122, 123], "affiliations": [56], "keys": [70, 239, 240, 89, 241, 242, 243, 244, 245], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/lengeris14_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 41, "fields": {"title": "Unsupervised training methods for discriminative language modeling", "abstract": "Discriminative language modeling (DLM) aims to choose the most accurate word sequence by reranking the alternatives output by the automatic speech recognizer (ASR). The conventional (supervised) way of training a DLM requires a large amount of acoustic recordings together with their manual reference transcriptions. These transcriptions are used to determine the target ranks of the ASR outputs, but may be hard to obtain. Previous studies make use of the existing transcribed data to build a confusion model which boosts the training set by generating artificial data: a process known as semi-supervised training. In this study we concentrate on the unsupervised setting where no manual transcriptions are available at all. We propose three ways to determine a sequence that could serve as the missing reference text and two approaches which use this information to (i) determine the ranks of the ASR outputs in order to train the discriminative model directly, and (ii) build a confusion model in order to generate artificial training examples. We compare our techniques with the supervised and the semi-supervised setups. Using the reranking variant of the WER-sensitive perceptron algorithm, we obtain word error rate improvements up to half of those of the supervised case.", "conference": 5, "authors": [124, 125], "affiliations": [57, 58], "keys": [246, 1, 247, 72, 248, 249, 250, 143, 92], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/dikici14_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 42, "fields": {"title": "Effect of spectral degradation to the intelligibility of vowel sentences", "abstract": "Based on the noise-replacement paradigm, recent studies showed that vowels carried more perceptional information for sentence intelligibility than consonants. Considering that vowels contain many important acoustic cues for speech perception, this study further assessed the effect of spectral degradation to the intelligibility of Mandarin vowel sentences. Mandarin sentences were processed to generate three types of spectrally degraded [i.e., fundamental frequency (F0) flattened, sinewave synthesized, and noise-vocoded] stimuli. Noise-replacement paradigm was implemented to preserve different amounts of vowel centers and replace the rest with noise. Listening experiments showed that flattening F0 had a minimal effect on the intelligibility of Mandarin vowel sentences, and the harmonic structure within vowels accounted more for the intelligibility of Mandarin vowel sentences. While deleting vowel edges had little influence on the intelligibility of the unprocessed vowel sentences, it had a significantly negative effect on the intelligibility of vowel sentences with spectral degradation.", "conference": 5, "authors": [126, 127, 128], "affiliations": [59], "keys": [251, 114, 252, 253], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2014/chen14i_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 43, "fields": {"title": "Auto-imputing radial basis functions for neural-network turn-taking models", "abstract": "A stochastic turn-taking (STT) model is a per-frame predictor of incipient speech activity. Its ability to make predictions at any instant in time makes it particularly well-suited to the analysis and synthesis of interactive conversation. At the current time, however, STT models are limited by their inability to accept features which may frequently be undefined. Rather than attempting to impute such features, this work proposes and evaluates a mechanism which implicitly conditions Gaussian-distributed features on Bernoulli-distributed indicator features, making prior imputation unnecessary. Experiments indicate that the proposed mechanisms achieve predictive parity with standard model structures, while at the same time offering more direct interpretability and the desired insensitivity to missing feature values.", "conference": 6, "authors": [129], "affiliations": [60, 46, 61], "keys": [254, 255, 256, 257, 9, 193, 258, 198, 259], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/laskowski15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 44, "fields": {"title": "Cross-modality matching of linguistic and emotional prosody", "abstract": "Talkers can express different meanings or emotions without changing what is said by changing how it is said (by using both auditory and/or visual speech cues). Typically, cue strength differs between the auditory and visual channels: linguistic prosody (expression) is clearest in audition; emotional prosody is clearest visually. We investigated how well perceivers can match auditory and visual linguistic and emotional prosodic signals. Previous research showed that perceivers can match linguistic visual and auditory prosody reasonably well. The current study extended this by also testing how well auditory and visual spoken emotion expressions could be matched. Participants were presented a pair of sentences (consisting of the same segmental content) spoken by the same talker and were required to decide whether the pair had the same prosody. Twenty sentences were tested with two types of prosody (emotional vs. linguistic), two talkers, and four matching conditions: auditory-auditory (AA); visual-visual (VV); auditory-visual (AV); and visual-auditory (VA). Linguistic prosody was accurately matched in all conditions. Matching emotional expressions was excellent for VV, poorer for VA, and near chance for AA and AV presentations. These differences are discussed in terms of the relationship between types of auditory and visual cues and task effects.", "conference": 6, "authors": [130, 131, 132], "affiliations": [62], "keys": [], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/simonetti15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 45, "fields": {"title": "On evaluation metrics for social signal detection", "abstract": "Social signal detection is a task in speech technology which has recently became more popular. In the Interspeech 2013 ComParE Challenge one of the tasks was social signal detection, and since then, new results have been published on the dataset. These studies all used the Area Under Curve (AUC) metric to evaluate the performance; here we argue that this metric is not really suitable for social signals detection. Besides raising some serious theoretical objections, we will also demonstrate this unsuitability experimentally: we will show that applying a very simple smoothing function on the output of the frame-level scores of state-of-the-art classifiers can significantly improve the AUC scores, but perform poorly when employed in a Hidden Markov Model. As the latter is more like real-world applications, we suggest relying on utterance-level evaluation metrics in the future.", "conference": 6, "authors": [133], "affiliations": [], "keys": [260, 261, 262, 263, 264, 265, 266, 186, 267], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/gosztolya15b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 46, "fields": {"title": "Perception of an existing and non-existing L2 English phoneme behind noise by Japanese native speakers", "abstract": "This study investigates how similarly a person hears an existing and non-existing speech sound behind noise in L2, as compared to L1 reported in Mattys, Barkan, and Samuel (2014). Participants were Japanese native speakers who spoke English as a second language. They listened to English words and non-words in which a phoneme was covered by noise (added) or replaced by noise (replaced). The target phoneme was either a liquid or a nasal. In experiment, participants listened to a pair of a word with noise (added or replaced) and a word without noise (normal) in a row, and evaluated the similarity of the two by using an 8-point scale. The results suggested that L2 listeners perceived the added and replaced sound significantly differently. L2 listeners found the added sound (a phoneme + noise) more similar to a normal sound than the replaced sound (noise only), as was also reported in L1 listeners. At the same time, they also perceived the illusory sound of a missing phoneme in the replaced condition. A missing nasal was significantly more restored than a missing liquid. There was no lexical effect in perceptual restoration of phonemes among L2 listeners, although it was reported among L1 listeners.", "conference": 6, "authors": [134, 72], "affiliations": [34], "keys": [1, 268, 269, 270, 271, 272], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/ishida15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 47, "fields": {"title": "Phonetic/linguistic web services at BAS", "abstract": "We present recent developments in the collection of phonetic-linguistic web services provided by the Bavarian Archive of Speech Signals (BAS). The BAS back end web services are REST based and can be easily integrated into user applications. Several public web interfaces have been implemented that utilize these back end services to provide easy-to-use access to high-end linguistic and phonetic processing (front end services). In this show&tell we demonstrate the latest front end services of BAS: automatic phonetic segmentation & labelling using the MAUS technique (14 languages), text-to-phoneme conversion (13 languages), automatic phonetic transcription (6 languages), phonetic syllabification (13 languages), and speech synthesis.", "conference": 6, "authors": [135, 136, 137, 138], "affiliations": [63], "keys": [273, 274, 275, 276, 226, 277, 278, 279, 280, 281, 282, 283, 284], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/kisler15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 48, "fields": {"title": "The technology powering personal digital assistants", "abstract": "We have long envisioned that one day computers will understand natural language and anticipate what we need and when we need it to proactively complete tasks on our behalf. As computers get smaller and more pervasive, how humans interact with them is becoming a crucial issue. Despite numerous attempts over the past 40 years to make language understanding an effective and robust natural user interface for computer interaction, success was limited and scoped to applications that are not particularly central to everyday use. However, advances in speech recognition and machine learning, coupled with the emergence of structured data served by content providers and increased computational power have broadened the application of natural language understanding to a wide spectrum of everyday tasks that are central to the user's productivity. We believe that as computers become smaller and more ubiquitous (eg wearable computers) and as the number of applications increases, both system-initiated and user initiated task completion across various applications and services will become indispensable for personal life management and work productivity. There has been already a tremendous investment in the industry (particularly Microsoft, Google, Apple, Amazon and Nuance) around digital personal assistants during the last couple of years. Each of the major companies in the speech and language technology space has a version of their personal assistants (Cortana, Google Now, Siri, Echo, and Dragon, respectively) deployed in production. Yet there is not much talked about these technologies and products in any of the speech and language technology conferences. In this talk, we give an overview of personal digital assistants, describe the system design, architecture and the key components behind them. We will highlight challenges and describe best practices related to the bringing personal assistants from laboratories to the real-world and discuss their potential to fully redefine the human-computer interaction moving forward.", "conference": 6, "authors": [139], "affiliations": [], "keys": [], "url": "https://www.isca-speech.org/archive/interspeech_2015/sarikaya15_interspeech.html"}}, {"model": "ver0.paper", "pk": 49, "fields": {"title": "Effect of trapping questions on the reliability of speech quality judgments in a crowdsourcing paradigm", "abstract": "This paper reports on a crowdsourcing study investigating the influence of trapping questions on the reliability of the collected data. The crowd workers were asked to provide quality ratings for speech samples from a standard database. In addition, they were presented with different types of trapping questions, which were designed based on previous research. The ratings obtained from the crowd workers were compared to ratings collected in a laboratory setting. Best results (i.e. highest correlation with and lowest root-mean-square deviation from the lab ratings) were observed for the type of trapping question, for which a recorded voice was presented in the middle of a random stimuli. The voice explained to the workers that high quality responses are important to us, and asked them to select a specific item to show their concentration. We hypothesize that this kind of trapping question communicates the importance and the value of their work to the crowd workers. Based on Herzberg two-factor theory of job satisfaction, the presence of factors, such as acknowledgment and the feeling of being valued, facilitates satisfaction and motivation, and eventually leads to better performance.", "conference": 6, "authors": [109, 110, 140, 141, 113], "affiliations": [64, 52], "keys": [285, 286, 214, 216, 287, 288], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/naderi15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 50, "fields": {"title": "Rapid adaptation for deep neural networks through multi-task learning", "abstract": "We propose a novel approach to addressing the adaptation effectiveness issue in parameter adaptation for deep neural network (DNN) based acoustic models for automatic speech recognition by adding one or more small auxiliary output layers modeling broad acoustic units, such as mono-phones or tied-state (often called senone) clusters. In scenarios with a limited amount of available adaptation data, most senones are usually rarely seen or not observed, and consequently the ability to model them in a new condition is often not fully exploited. With the original senone classification task as the primary task, and adding auxiliary mono-phone/senone-cluster classification as the secondary tasks, multi-task learning (MTL) is employed to adapt the DNN parameters. With the proposed MTL adaptation framework, we improve the learning ability of the original DNN structure, then enlarge the coverage of the acoustic space to deal with the unseen senone problem, and thus enhance the discrimination power of the adapted DNN models. Experimental results on the 20,000-word open vocabulary WSJ task demonstrate that the proposed framework consistently outperforms the conventional linear hidden layer adaptation schemes without MTL by providing 5.4% relative reduction in word error rate (WERR) with only 1 single adaptation utterance, and 10.7% WERR with 40 adaptation utterances against the un-adapted DNN models.", "conference": 6, "authors": [142, 143, 144, 145, 146, 147], "affiliations": [65, 66, 67, 68], "keys": [289, 261, 290, 291, 292, 92, 186, 293, 294, 295, 40], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/huang15h_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 51, "fields": {"title": "Robust pitch estimation in noisy speech using ZTW and group delay function", "abstract": "Identification of pitch for speech signals recorded in noisy environments is a fundamental and long persistent problem in speech research. Several time domain based techniques attempt to exploit the periodic nature of the waveform using autocorrelation function and its variants. Other set of techniques utilize the harmonic structure in the spectral domain to identify pitch values. Either of these techniques suffer significant degradation in their performance in cases of noisy speech signals with low SNRs. The paper presents a robust technique to identify pitch values for speech signals. The proposed algorithm utilizes a speech analysis method called zero-time windowing (ZTW) where the signal is processed using a heavily decaying window, and the spectral characteristics are highlighted using the numerator of the group delay function. The amplitude contour of dominant resonances in the spectra are extracted, and processed further using a Gaussian window. The resulting contour reflects the energy profile of the signal which is utilized for estimation of the pitch values. The proposed algorithm is robust to degradations, and has been tested on several utterances with added noises. The algorithm exhibits significant increment in performance when compared to existing techniques.", "conference": 6, "authors": [148, 149], "affiliations": [], "keys": [89, 296, 297, 298, 299, 300, 301, 302], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/prasad15b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 52, "fields": {"title": "Prosodic phrasing unique to the acquisition of L2 intonation — an analysis of L2 Japanese intonation by L1 Swedish learners", "abstract": "This paper examines the prosodic organization of L2 Japanese produced by L1 Swedish at the beginner level. Japanese and Swedish have been well studied for their prosodic structures and some well-defined prosodic phrases have been proposed. However, these existing prosodic phrases are found to be inadequate in analyzing L2 intonation seen as interlanguage. Instead, it consists of some unique phrasing showing the characteristics of interlanguage, i.e. a language that has its own system and it changes continuously during the acquisition process. Studies on interlanguage are mostly on grammar and not much is known about the acquisition of L2 intonation. The results reveal that the beginner level L2 intonation is characterized by many pauses that are inserted at every grammatical phrase boundary. Such a phasing is unique as interlanguage and presumably universal in the less fluent speech at the beginner level. While a typical prosodic phrasing in Japanese uses downstep to group APs to iPs, a typical phrasing in L2 Japanese produced by L1 Swedish uses upstep and some other patterns instead. They are considered to be L1 prosodic transfer.", "conference": 6, "authors": [150], "affiliations": [69], "keys": [303, 304, 244, 305, 306, 307, 151], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/naganomadsen15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 53, "fields": {"title": "A multi-region deep neural network model in speech recognition", "abstract": "This work proposes a new architecture for deep neural network training. Instead of having one cascade of fully connected hidden layers between the input features and the target output, the new architecture organizes hidden layers into several regions with each region having its own target. Regions communicate with each other during the training process by connections among intermediate hidden layers to share learned internal representations from their respective targets. They do not have to share the same input features. This paper presents the performance of acoustic models built using this architecture with speaker independent and dependent features. Experimental results are compared with not only the baseline DNN model, but also the ensemble DNN, unfolded RNN and stacked DNN. Experiments on the IARPA sponsored Babel tasks demonstrate improvements ranging from 0.8% to 2.7% absolute reduction in WER.", "conference": 6, "authors": [151, 152, 153, 154], "affiliations": [70], "keys": [24, 308, 309, 310, 2, 311, 92, 143, 186, 312, 295], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/cui15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 54, "fields": {"title": "Tongue tracking in ultrasound images using eigentongue decomposition and artificial neural networks", "abstract": "This paper describes a machine learning approach for extracting automatically the tongue contour in ultrasound images. This method is developed in the context of visual articulatory biofeedback for speech therapy. The goal is to provide a speaker with an intuitive visualization of his/her tongue movement, in real-time, and with minimum human intervention. Contrary to most widely used techniques based on active contours, the proposed method aims at exploiting the information of all image pixels to infer the tongue contour. For that purpose, a compact representation of each image is extracted using a PCA-based decomposition technique (named EigenTongue). Artificial neural networks are then used to convert the extracted visual features into control parameters of a PCA-based tongue contour model. The proposed method is evaluated on 9 speakers, using data recorded with the ultrasound probe hold manually (as in the targeted application). Speaker-dependent experiments demonstrated the effectiveness of the proposed method (with an average error of ~1.3 mm when training from 80 manually annotated images), even when the tongue contour is poorly imaged. The performance was significantly lower in speaker-independent experiments ( i.e. when estimating contours on an unknown speaker), likely due to anatomical differences across speakers.", "conference": 6, "authors": [155, 156, 157, 158], "affiliations": [71, 72], "keys": [15, 313, 314, 315, 2, 17, 316, 64, 317, 318], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/fabre15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 55, "fields": {"title": "Efficient use of DNN bottleneck features in generalized variable parameter HMMs for noise robust speech recognition", "abstract": "Recently a new approach to incorporate deep neural networks (DNN) bottleneck features into HMM based acoustic models using generalized variable parameter HMMs (GVP-HMMs) was proposed. As Gaussian component level polynomial interpolation is performed for each high dimensional DNN bottleneck feature vector at a frame level, conventional GVP-HMMs are computationally expensive to use in recognition time. To handle this problem, several approaches were exploited in this paper to efficiently use DNN bottleneck features in GVP-HMMs, including model selection techniques to optimally reduce the polynomial degrees; an efficient GMM based bottleneck feature clustering scheme; more compact GVP-HMM trajectory modelling for model space tied linear transformations. These improvements gave a total of 16 time speed up in decoding time over conventional GVP-HMMs using a uniformly assigned polynomial degree. Significant error rate reductions of 15.6% relative were obtained over the baseline tandem HMM system on the secondary microphone channel condition of Aurora 4 task. Consistent improvements were also obtained on other subsets.", "conference": 6, "authors": [159, 160, 161, 162], "affiliations": [73, 74, 75], "keys": [295, 24, 319, 320, 321, 49, 322, 323, 186, 38, 22], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/su15b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 56, "fields": {"title": "The relationship between acoustic and perceived intraspeaker variability in voice quality", "abstract": "Little is known about intraspeaker changes in voice across changing speaking situations in everyday life. In this study, we examined acoustic variations between and within 5 talkers and their effect on the likelihood that voice samples would not be identified as coming from the same talker. Talkers were drawn from a large database recorded to capture everyday variations in vocal characteristics. Nine samples of /a/, recorded on three different days, were examined for each talker. Acoustic characteristics were estimated using VoiceSauce and analysis-by-synthesis, and listeners judged whether pairs of voices came from the same or two different talkers. Results indicate that interspeaker variability in voice quality exceeds intraspeaker variability, but differences are smaller than expected. As predicted by models that treat voice quality as an auditory pattern, the acoustic attributes associated with incorrect “different speaker” responses varied from talker to talker, depending on the particular characteristics of the voice in question.", "conference": 6, "authors": [163, 164, 165, 166], "affiliations": [76], "keys": [324, 325, 96, 326], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/kreiman15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 57, "fields": {"title": "Online Lombard adaptation in incremental speech synthesis", "abstract": "The `Lombard effect' consists of various speech adaptation mechanisms human speakers use involuntarily to counter influences that a noisy environment has on their speech intelligibility. These adaptations are highly dependent on the characteristics of the noise and happen rapidly. Modelling the effect for the output side of speech interfaces is therefore difficult: the noise characteristics need to be evaluated continuously and speech synthesis adaptations need to take effect immediately. This paper describes and evaluates an online system consisting of a module that analyses the acoustic environment and a module that adapts the speech parameters of an incremental speech synthesis system in a timely manner. In an evaluation with human listeners the system had a similar effect on intelligibility as had human speakers in offline studies. Furthermore, during noise the Lombard-adapted speech was rated more natural than standard speech.", "conference": 6, "authors": [167, 168, 169, 170], "affiliations": [77, 78], "keys": [327, 24, 328, 292, 329, 330, 331, 332, 253], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2015/rottschafer15_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 58, "fields": {"title": "Improving Automatic Recognition of Aphasic Speech with AphasiaBank", "abstract": "Automatic recognition of aphasic speech is challenging due to various\nspeech-language impairments associated with aphasia as well as a scarcity\nof training data appropriate for this speaker population. AphasiaBank,\na shared database of multimedia interactions primarily used by clinicians\nto study aphasia, offers a promising source of data for Deep Neural\nNetwork acoustic modeling. In this paper, we establish the first large-vocabulary\ncontinuous speech recognition baseline on AphasiaBank and study recognition\naccuracy as a function of diagnoses. We investigate several out-of-domain\nadaptation methods and show that AphasiaBank data can be leveraged\nto significantly improve the recognition rate on a smaller aphasic\nspeech corpus. This work helps broaden the understanding of aphasic\nspeech recognition, demonstrates the potential of AphasiaBank, and\nguides researchers who wish to use this database for their own work.", "conference": 7, "authors": [171, 172], "affiliations": [79], "keys": [333, 24, 2, 334, 335, 336, 337, 338], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2016/le16b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 59, "fields": {"title": "Improved Depiction of Tissue Boundaries in Vocal Tract Real-Time MRI Using Automatic Off-Resonance Correction", "abstract": "Real-time magnetic resonance imaging (RT-MRI) is a powerful tool to\nstudy the dynamics of vocal tract shaping during speech production.\nThe dynamic articulators of interest include the surfaces of the lips,\ntongue, hard palate, soft palate, and pharyngeal airway. All of these\nare located at air-tissue interfaces and are vulnerable to MRI off-resonance\neffect due to magnetic susceptibility. In RT-MRI using spiral or radial\nscanning, this appears as a signal loss or blurring in images and may\nimpair the analysis of dynamic speech data. We apply an automatic off-resonance\nartifact correction method to speech RT-MRI data in order to enhance\nthe sharpness of air-tissue boundaries. We demonstrate the improvement\nqualitatively and using an image sharpness metric offering an improved\ntool for speech science research.", "conference": 7, "authors": [173, 174, 175, 10, 176], "affiliations": [], "keys": [19], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2016/lim16b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 60, "fields": {"title": "Investigation of Speed-Accuracy Tradeoffs in Speech Production Using Real-Time Magnetic Resonance Imaging", "abstract": "Motor actions in speech production are both rapid and highly dexterous,\neven though speed and accuracy are often thought to conflict. Fitts’\nlaw has served as a rigorous formulation of the fundamental speed-accuracy\ntradeoff in other domains of human motor action, but has not been directly\nexamined with respect to speech production. This paper examines Fitts’\nlaw in speech articulation kinematics by analyzing USC-TIMIT, a large\ndatabase of real-time magnetic resonance imaging data of speech production.\nThis paper also addresses methodological challenges in applying Fitts-style\nanalysis, including the definition and operational measurement of key\nvariables in real-time MRI data. Results suggest high variability in\nthe task demands associated with targeted articulatory kinematics,\nas well as a clear tradeoff between speed and accuracy for certain\ntypes of speech production actions. Consonant targets, and particularly\nthose following vowels, show the strongest evidence of this tradeoff,\nwith correlations as high as 0.71 between movement time and difficulty.\nOther speech actions seem to challenge Fitts’ law. Results are\ndiscussed with respect to limitations of Fitts’ law in the context\nof speech production, as well as future improvements and applications.", "conference": 7, "authors": [177, 178, 10, 179], "affiliations": [80, 81, 82], "keys": [204, 339, 340, 206, 341, 207, 342, 19, 343, 20], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2016/lammert16_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 61, "fields": {"title": "Short Utterance Variance Modelling and Utterance Partitioning for PLDA Speaker Verification", "abstract": "This paper analyses the short utterance probabilistic linear discriminant\nanalysis (PLDA) speaker verification with utterance partitioning and\nshort utterance variance (SUV) modelling approaches. Experimental studies\nhave found that instead of using single long-utterance as enrolment\ndata, if long enrolled-utterance is partitioned into multiple short\nutterances and average of short utterance i-vectors is used as enrolled\ndata, that improves the Gaussian PLDA (GPLDA) speaker verification.\nThis is because short utterance i-vectors have speaker, session and\nutterance variations, and utterance-partitioning approach compensates\nthe utterance variation. Subsequently, SUV-PLDA is also studied with\nutterance partitioning approach, and utterance-partitioning-based SUV-GPLDA\nsystem shows relative improvement of 9% and 16% in EER for NIST 2008\nand NIST 2010 truncated 10sec-10sec evaluation condition as utterance-partitioning\napproach compensates the utterance variation and SUV modelling approach\ncompensates the mismatch between full-length development data and short-length\nevaluation data.", "conference": 7, "authors": [180, 181, 182, 183, 184], "affiliations": [83], "keys": [62, 344, 345, 42, 346, 347, 348, 349, 350, 43, 351, 352], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2016/kanagasundaram16_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 62, "fields": {"title": "A Fast and Accurate Fundamental Frequency Estimator Using Recursive Moving Average Filters", "abstract": "We propose a fundamental frequency (F0) estimation method which is\nfast, accurate and suitable for real-time use. While the proposed method\nis based on the same framework as DIO [1, 2], it has two clear differences:\nit uses RMA (Recursive Moving Average) filters for attenuating high\norder harmonics, and the period detector is designed to work well even\nfor signals which contain some higher harmonics. Effect of trace-back\nduration of post-processing was also examined. Evaluation experiments\nusing natural speech databases showed that the accuracy of the proposed\nmethod was better than DIO, SWIPE' [3] and YIN [4] and computation\nspeed was the fastest compared to those existing methods.", "conference": 7, "authors": [185, 186], "affiliations": [84], "keys": [353, 354, 355, 356, 357, 358, 359, 360, 361], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2016/daido16_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 63, "fields": {"title": "Test-Retest Repeatability of Articulatory Strategies Using Real-Time Magnetic Resonance Imaging", "abstract": "Real-time magnetic resonance imaging (rtMRI) provides information about\nthe dynamic shaping of the vocal tract during speech production. This\npaper introduces and evaluates a method for quantifying articulatory\nstrategies using rtMRI. The method decomposes the formation and release\nof a constriction in the vocal tract into the contributions of individual\narticulators such as the jaw, tongue, lips, and velum. The method uses\nan anatomically guided factor analysis and dynamical principles from\nthe framework of Task Dynamics. We evaluated the method within a test-retest\nrepeatability framework. We imaged healthy volunteers (n = 8, 4 females,\n4 males) in two scans on the same day and quantified inter-study agreement\nwith the intraclass correlation coefficient and mean within-subject\nstandard deviation. The evaluation established a limit on effect size\nand intra-group differences in articulatory strategy which can be studied\nusing the method.", "conference": 8, "authors": [187, 175, 188, 9, 10], "affiliations": [3], "keys": [15, 19, 17, 362], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/sorensen17b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 64, "fields": {"title": "Google’s Next-Generation Real-Time Unit-Selection Synthesizer Using Sequence-to-Sequence LSTM-Based Autoencoders", "abstract": "A neural network model that significant improves unit-selection-based\nText-To-Speech synthesis is presented. The model employs a sequence-to-sequence\nLSTM-based autoencoder that compresses the acoustic and linguistic\nfeatures of each unit to a fixed-size vector referred to as an  embedding.\nUnit-selection is facilitated by formulating the target cost as an\nL", "conference": 8, "authors": [189, 190, 191, 192], "affiliations": [85], "keys": [363, 364, 226, 245, 365, 366], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/wan17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 65, "fields": {"title": "Exploring the Use of Significant Words Language Modeling for Spoken Document Retrieval", "abstract": "Owing to the rapid global access to tremendous amounts of multimedia\nassociated with speech information on the Internet, spoken document\nretrieval (SDR) has become an emerging application recently. Apart\nfrom much effort devoted to developing robust indexing and modeling\ntechniques for spoken documents, a recent line of research targets\nat enriching and reformulating query representations in an attempt\nto enhance retrieval effectiveness. In practice, pseudo-relevance feedback\nis by far the most prevalent paradigm for query reformulation, which\nassumes that top-ranked feedback documents obtained from the initial\nround of retrieval are potentially relevant and can be exploited to\nreformulate the original query. Continuing this line of research, the\npaper presents a novel modeling framework, which aims at discovering\nsignificant words occurring in the feedback documents, to infer an\nenhanced query language model for SDR. Formally, the proposed framework\ntargets at extracting the essential words representing a common notion\nof relevance (i.e., the significant words which occur in almost all\nof the feedback documents), so as to deduce a new query language model\nthat captures these significant words and meanwhile modulates the influence\nof both highly frequent words and too specific words. Experiments conducted\non a benchmark SDR task demonstrate the performance merits of our proposed\nframework.", "conference": 8, "authors": [193, 194, 195, 196], "affiliations": [86, 87], "keys": [227, 367, 368, 369, 370, 371], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/chen17l_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 66, "fields": {"title": "Cross-Modal Analysis Between Phonation Differences and Texture Images Based on Sentiment Correlations", "abstract": "Motivated by the success of speech characteristics representation by\ncolor attributes, we analyzed the cross-modal sentiment correlations\nbetween voice source characteristics and textural image characteristics.\nFor the analysis, we employed vowel sounds with representative three\nphonation differences (modal, creaky and breathy) and 36 texture images\nwith 36 semantic attributes (e.g., banded, cracked and scaly) annotated\none semantic attribute for each texture. By asking 40 subjects to select\nthe most fitted textures from 36 figures with different textures after\nlistening 30 speech samples with different phonations, we measured\nthe correlations between acoustic parameters showing voice source variations\nand the parameters of selected textural image differences showing coarseness,\ncontrast, directionality, busyness, complexity and strength. From the\ntexture classifications, voice characteristics can be roughly characterized\nby textural differences: modal — gauzy, banded and smeared, creaky\n— porous, crystalline, cracked and scaly, breathy — smeared,\nfreckled and stained. We have also found significant correlations between\nvoice source acoustic parameters and textural parameters. These correlations\nsuggest the possibility of cross-modal mapping between voice source\ncharacteristics and textural parameters, which enables visualization\nof speech information with source variations reflecting human sentiment\nperception.", "conference": 8, "authors": [197, 198], "affiliations": [88], "keys": [372, 28, 199, 87, 373, 374, 375, 376], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/kyaw17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 67, "fields": {"title": "Creating a Voice for  MiRo, the World’s First Commercial Biomimetic Robot", "abstract": "This paper introduces  MiRo — the world’s first commercial\nbiomimetic robot — and describes how its vocal system was designed\nusing a real-time parametric general-purpose mammalian vocal synthesiser\ntailored to the specific physical characteristics of the robot.  MiRo’s\ncapabilities will be demonstrated live during the hands-on interactive\n‘Show & Tell’ session at INTERSPEECH-2017.", "conference": 8, "authors": [199, 200], "affiliations": [89, 90], "keys": [377, 378, 379, 380, 381, 382, 383, 384, 385], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/moore17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 68, "fields": {"title": "Speech Recognition and Understanding on Hardware-Accelerated DSP", "abstract": "A smart home controller that responds to natural language input is\ndemonstrated on an Intel embedded processor. This device contains two\nDSP cores and a neural network co-processor which share 4MB SRAM. An\nembedded configuration of the Intel RealSpeech speech recognizer and\nintent extraction engine runs on the DSP cores with neural network\noperations offloaded to the co-processor. The prototype demonstrates\nthat continuous speech recognition and understanding is possible on\nhardware with very low power consumption. As an example application,\ncontrol of lights in a home via natural language is shown. An Intel\ndevelopment kit is demonstrated together with a set of tools. Conference\nattendees are encouraged to interact with the demo and development\nsystem.", "conference": 8, "authors": [201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211], "affiliations": [91], "keys": [386, 387, 388, 389, 24, 2, 390, 391, 392], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/stemmer17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 69, "fields": {"title": "The Kaldi OpenKWS System: Improving Low Resource Keyword Search", "abstract": "The IARPA BABEL program has stimulated worldwide research in keyword\nsearch technology for low resource languages, and the NIST OpenKWS\nevaluations are the de facto benchmark test for such capabilities.\nThe 2016 OpenKWS evaluation featured Georgian speech, and had 10 participants\nfrom across the world. This paper describes the Kaldi system developed\nto assist IARPA in creating a competitive baseline against which participants\nwere evaluated, and to provide a truly open source system to all participants\nto support their research. This system handily met the BABEL program\ngoals of 0.60 ATWV and 50% WER, achieving 0.70 ATWV and 38% WER with\na single ASR system, i.e.  without ASR system combination. All except\none OpenKWS participant used Kaldi components in their submissions,\ntypically in conjunction with system combination. This paper therefore\ncomplements all other OpenKWS-based papers.", "conference": 8, "authors": [212, 213, 214, 215, 216, 217, 218, 219, 220, 221], "affiliations": [92, 44], "keys": [393, 394, 310, 168, 58, 395, 210, 72, 24, 308, 92, 396, 42, 397, 398, 309, 399, 2, 400, 43], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/trmal17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 70, "fields": {"title": "Autoencoder Based Domain Adaptation for Speaker Recognition Under Insufficient Channel Information", "abstract": "In real-life conditions, mismatch between development and test domain\ndegrades speaker recognition performance. To solve the issue, many\nresearchers explored domain adaptation approaches using matched in-domain\ndataset. However, adaptation would be not effective if the dataset\nis insufficient to estimate channel variability of the domain. In this\npaper, we explore the problem of performance degradation under such\na situation of insufficient channel information. In order to exploit\nlimited in-domain dataset effectively, we propose an unsupervised domain\nadaptation approach using Autoencoder based Domain Adaptation (AEDA).\nThe proposed approach combines an autoencoder with a denoising autoencoder\nto adapt resource-rich development dataset to test domain. The proposed\ntechnique is evaluated on the Domain Adaptation Challenge 13 experimental\nprotocols that is widely used in speaker recognition for domain mismatched\ncondition. The results show significant improvements over baselines\nand results from other prior studies.", "conference": 8, "authors": [222, 223, 50, 224], "affiliations": [93, 94], "keys": [401, 402, 403, 404, 405, 406, 334, 407, 96, 408, 40], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/shon17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 71, "fields": {"title": "Automatic Explanation Spot Estimation Method Targeted at Text and Figures in Lecture Slides", "abstract": "Because of the spread of the Internet in recent years, e-learning,\nwhich is a form of learning through the Internet, has been used in\nschool education. Many lecture videos delivered at The Open University\nof Japan show lecturers and lecture slides alternately. In such video\nstyle, it is hard to understand where on the slide the lecturer is\nexplaining. In this paper, we examined methods to automatically estimate\nspots where the lecturer explains on the slide using lecture speech\nand slide data. This technology is expected to help learners to study\nthe lectures. For itemized text slides, using DTW with word embedding\nbased distance, we obtained higher estimation accuracy than a previous\nwork. For slides containing figures, we estimated explanation spots\nusing image classification results and text in the charts. In addition,\nwe modified the lecture browsing system to indicate estimation results\non slides, and investigated the usefulness of indicating explanation\nspots by subjective evaluation with the system.", "conference": 8, "authors": [225, 226, 227], "affiliations": [28, 95], "keys": [409, 410, 411, 226, 412], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/tsujimura17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 72, "fields": {"title": "Prosody Control of Utterance Sequence for Information Delivering", "abstract": "We propose a conversational speech synthesis system in which the prosodic\nfeatures of each utterance are controlled throughout the entire input\ntext. We have developed a “news-telling system,” which\ndelivered news articles through spoken language. The speech synthesis\nsystem for the news-telling should be able to highlight utterances\ncontaining noteworthy information in the article with a particular\nway of speaking so as to impress them on the users. To achieve this,\nwe introduced role and position features of the individual utterances\nin the article into the control parameters for prosody generation throughout\nthe text. We defined three categories for the role feature: a nucleus\n(which is assigned to the utterance including the noteworthy information),\na front satellite (which precedes the nucleus) and a rear satellite\n(which follows the nucleus). We investigated how the prosodic features\ndiffered depending on the role and position features through an analysis\nof news-telling speech data uttered by a voice actress. We designed\nthe speech synthesis system on the basis of a deep neural network having\nthe role and position features added to its input layer. Objective\nand subjective evaluation results showed that introducing those features\nwas effective in the speech synthesis for the information delivering.", "conference": 8, "authors": [228, 229, 230], "affiliations": [88], "keys": [413, 24, 328, 414, 415, 416, 198], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2017/fukuoka17_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 73, "fields": {"title": "Efficient Language Model Adaptation with Noise Contrastive Estimation and Kullback-Leibler Regularization", "abstract": "Many language modeling (LM) tasks have limited in-domain data for training. Exploiting out-of-domain data while retaining the relevant in-domain statistics is a desired property in these scenarios. Kullback-Leibler Divergence (KLD) regularization is a popular method for acoustic model (AM) adaptation. KLD regularization assumes that the last layer is a softmax that fully activates the targets of both in-domain and out-of-domain models. Unfortunately, this softmax activation is computationally prohibitive for language modeling where the number of output classes is large, typically 50k to 100K, but may even exceed 800k in some cases. The computational bottleneck of the softmax during LM training can be reduced by an order of magnitude using techniques such as noise contrastive estimation (NCE), which replaces the cross-entropy loss function with a binary classification problem between the target output and random noise samples. In this work we combine NCE and KLD regularization and offer a fast domain adaptation method for LM training, while also retaining important attributes of the original NCE, such as self-normalization. We show on a medical domain-adaptation task that our method improves perplexity by 10.1% relative to a strong LSTM baseline.", "conference": 9, "authors": [231, 232, 233], "affiliations": [96], "keys": [1, 24, 417, 2, 245, 365, 292, 418, 419], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2018/andresferrer18_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 74, "fields": {"title": "Conditional End-to-End Audio Transforms", "abstract": "We present an end-to-end method for transforming audio from one style to another. For the case of speech, by conditioning on speaker identities, we can train a single model to transform words spoken by multiple people into multiple target voices. For the case of music, we can specify musical instruments and achieve the same result. Architecturally, our method is a fully-differentiable sequence-to-sequence model based on convolutional and hierarchical recurrent neural networks. It is designed to capture long-term acoustic dependencies, requires minimal post-processing and produces realistic audio transforms. Ablation studies confirm that our model can separate acoustic properties from musical and language content at different receptive fields. Empirically, our method achieves competitive performance on community-standard datasets.", "conference": 9, "authors": [234, 235, 236], "affiliations": [97], "keys": [], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2018/haque18_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 75, "fields": {"title": "Paired Phone-Posteriors Approach to ESL Pronunciation Quality Assessment", "abstract": "This work proposes to incorporate paired phone-posteriors as input features into a neural net (NN) model for assessing ESL learner’s pronunciation quality. In this work, posteriors of forty phones, instead of several thousand sub-phonemic senones, are used to circumvent the sparsity issues in NN training. Phone posteriors are assembled with their corresponding senone posteriors estimated via a speaker-independent, DNN-based acoustic model, trained with standard American English speech data (i.e., Wall Street Journal database). Phone posteriors of both reference(standard American English speaker) and test speaker are paired together as augmented input feature vectors to train an NN based, 2-class, i.e., native vs nonnative speaker, classiﬁer. The Goodness of Pronunciation (GOP), a proven effective measure, is used as the baseline for comparison. The binary NN classiﬁer trained with such features achieves a high classification accuracy of 89.6% on native and non-native speakers’ data. The classiﬁer also shows a better equal error rate (EER) than the GOP-based baseline classiﬁer in either phone or word level pronunciation, i.e., at phone level from 18.3% to 6.2% and at word level from 12.98% to 2.54%.", "conference": 9, "authors": [237, 238, 239], "affiliations": [98, 99], "keys": [420, 421, 422, 423, 58, 424, 425, 295, 351], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2018/xiao18b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 76, "fields": {"title": "Deep Extractor Network for Target Speaker Recovery from Single Channel Speech Mixtures", "abstract": "Speaker-aware source separation methods are promising workarounds for major difficulties such as arbitrary source permutation and unknown number of sources. However, it remains challenging to achieve satisfying performance provided a very short available target speaker utterance (anchor). Here we present a novel \"deep extractor network\" which creates an extractor point for the target speaker in a canonical high dimensional embedding space and pulls together the time-frequency bins corresponding to the target speaker. The proposed model is different from prior works that the carnonical embedding space encodes knowledges of both the anchor and the mixture during training phase: first, embeddings for the anchor and mixture speech are separately constructed in a primary embedding space and then combined as an input to feed-forward layers to transform to a carnonical embedding space which we discover more stable than the primary one. Experimental results show that given a very short utterance, the proposed model can efficiently recover high quality target speech from a mixture, which outperforms various baseline models, with 5.2% and 6.6% relative improvements in SDR and PESQ respectively compared with a baseline oracle deep attracor model. Meanwhile, we show it can be generalized well to more than one interfering speaker.", "conference": 9, "authors": [240, 241, 242, 243, 244, 245, 246], "affiliations": [100], "keys": [426, 427, 428, 367, 429], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2018/wang18d_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 77, "fields": {"title": "End-to-End Multi-Speaker Speech Recognition Using Speaker Embeddings and Transfer Learning", "abstract": "This paper presents our latest investigation on end-to-end automatic\nspeech recognition (ASR) for overlapped speech. We propose to train\nan end-to-end system conditioned on speaker embeddings and further\nimproved by transfer learning from clean speech. This proposed framework\ndoes not require any parallel non-overlapped speech materials and is\nindependent of the number of speakers. Our experimental results on\noverlapped speech datasets show that joint conditioning on speaker\nembeddings and transfer learning significantly improves the ASR performance.", "conference": 10, "authors": [247, 248], "affiliations": [101], "keys": [72, 2, 430, 431, 432], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/denisov19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 78, "fields": {"title": "A Preliminary Study of Charismatic Speech on YouTube: Correlating Prosodic Variation with Counts of Subscribers, Views and Likes", "abstract": "This paper is a first investigation into the influence of the pitch\nrange and the intensity variation on the number of subscribers, views\nand likes of YouTube Creators. A total of ten minutes of speech material\nfrom five English and five North-American YouTubers was analyzed. The\nresults for pitch range and intensity variation suggest that an increase\nin both parameters results in higher subscriber counts. For views,\nthere was no influence of pitch range, but an increase in intensity\nvariation results in a lower number of views. Pitch range and intensity\nvariation had no influence on the like count. Furthermore, both origin\nand gender had an influence on the results. Ultimately, this study\nwill provide further information for the phonetic research of charisma\n(i.e., the perceived charm, competence, power, and persuasiveness of\na speaker), as it is suspected that the acoustic features that have\nso far been connected to charisma also play an important role in the\nsuccess of a YouTuber and their channel.", "conference": 10, "authors": [249, 78, 250], "affiliations": [102, 103, 104], "keys": [297, 433, 434, 435, 436, 437, 438, 439, 440], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/berger19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 79, "fields": {"title": "Articulatory Characteristics of Secondary Palatalization in Romanian Fricatives", "abstract": "This study explores the articulatory characteristics of plain and palatalized\nfricatives in Romanian. Based on earlier acoustic findings, we hypothesize\nthat there are differences in tongue raising and fronting depending\non the primary place of articulation, with more subtle gestures produced\nin the vicinity of the palatal area. We also predict more individual\nvariation in the realization of secondary palatalization in postalveolars,\nbased on general cross-linguistic patterns.", "conference": 10, "authors": [251, 252, 253], "affiliations": [105, 106], "keys": [441, 442, 443, 444, 445], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/spinu19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 80, "fields": {"title": "Using Speech Production Knowledge for Raw Waveform Modelling Based Styrian Dialect Identification", "abstract": "This paper addresses the Styrian Dialect sub-challenge of the INTERSPEECH\n2019 Computational Paralinguistics Challenge. We treat this challenge\nas dialect identification with no linguistic resources/knowledge and\nwith limited acoustic resources, and develop end-to-end raw waveform\nmodelling based methods that incorporate knowledge related to speech\nproduction. In this direction, we investigate two methods: (a) modelling\nthe signals after source system decomposition and (b) transferring\nknowledge from articulatory feature models trained on English language.\nOur investigations show that the proposed approaches on the ComParE\n2019 Styrian dialect data yield systems that perform better than low\nlevel descriptor-based and bag-of-audio-word representation based approaches\nand comparable to sequence-to-sequence auto-encoder based approach.", "conference": 10, "authors": [254, 255], "affiliations": [107], "keys": [446, 378, 427, 379, 447, 20, 448, 449, 382, 383, 450, 198, 451], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/dubagunta19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 81, "fields": {"title": "Optimizing Speech-Input Length for Speaker-Independent Depression Classification", "abstract": "Machine learning models for speech-based depression classification\noffer promise for health care applications. Despite growing work on\ndepression classification, little is understood about how the length\nof speech-input impacts model performance. We analyze results for speaker-independent\ndepression classification using a corpus of over 1400 hours of speech\nfrom a human-machine health screening application. We examine performance\nas a function of response input length for two NLP systems that differ\nin overall performance.", "conference": 10, "authors": [256, 257, 258, 259], "affiliations": [108], "keys": [452, 453, 454, 2, 455, 456, 457, 458, 459], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/rutowski19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 82, "fields": {"title": "Neural Network-Based Modeling of Phonetic Durations", "abstract": "A deep neural network (DNN)-based model has been developed to predict\nnon-parametric distributions of durations of phonemes in specified\nphonetic contexts and used to explore which factors influence durations\nmost. Major factors in US English are pre-pausal lengthening, lexical\nstress, and speaking rate. The model can be used to check that text-to-speech\n(TTS) training speech follows the script and words are pronounced as\nexpected. Duration prediction is poorer with training speech for automatic\nspeech recognition (ASR) because the training corpus typically consists\nof single utterances from many speakers and is often noisy or casually\nspoken. Low probability durations in ASR training material nevertheless\nmostly correspond to non-standard speech, with some having disfluencies.\nChildren’s speech is disproportionately present in these utterances,\nsince children show much more variation in timing.", "conference": 10, "authors": [260, 261, 262], "affiliations": [109], "keys": [1, 261, 72, 460, 55, 461, 462, 101, 186, 295, 463], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/wei19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 83, "fields": {"title": "Study of the Performance of Automatic Speech Recognition Systems in Speakers with Parkinson’s Disease", "abstract": "Parkinson’s Disease (PD) affects motor capabilities of patients,\nwho in some cases need to use human-computer assistive technologies\nto regain independence. The objective of this work is to study in detail\nthe differences in error patterns from state-of-the-art Automatic Speech\nRecognition (ASR) systems on speech from people with and without PD.\nTwo different speech recognizers (attention-based end-to-end and Deep\nNeural Network - Hidden Markov Models hybrid systems) were trained\non a Spanish language corpus and subsequently tested on speech from\n43 speakers with PD and 46 without PD. The differences related to error\nrates, substitutions, insertions and deletions of characters and phonetic\nunits between the two groups were analyzed, showing that the word error\nrate is 27% higher in speakers with PD than in control speakers, with\na moderated correlation between that rate and the developmental stage\nof the disease. The errors were related to all manner classes, and\nwere more pronounced in the vowel /u/. This study is the first to evaluate\nASR systems’ responses to speech from patients at different stages\nof PD in Spanish. The analyses showed general trends but individual\nspeech deficits must be studied in the future when designing new ASR\nsystems for this population.", "conference": 10, "authors": [263, 264, 265, 266, 267, 268, 269], "affiliations": [110, 111, 112], "keys": [464, 108, 261, 72, 465, 186, 371, 466], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/morovelazquez19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 84, "fields": {"title": "Variational Domain Adversarial Learning for Speaker Verification", "abstract": "Domain mismatch refers to the problem in which the distribution of\ntraining data differs from that of the test data. This paper proposes\na variational domain adversarial neural network (VDANN), which consists\nof a variational autoencoder (VAE) and a domain adversarial neural\nnetwork (DANN), to reduce domain mismatch. The DANN part aims to retain\nspeaker identity information and learn a feature space that is robust\nagainst domain mismatch, while the VAE part is to impose variational\nregularization on the learned features so that they follow a Gaussian\ndistribution. Thus, the representation produced by VDANN is not only\nspeaker discriminative and domain-invariant but also Gaussian distributed,\nwhich is essential for the standard PLDA backend. Experiments on both\nSRE16 and SRE18-CMN2 show that VDANN outperforms the Kaldi baseline\nand the standard DANN. The results also suggest that VAE regularization\nis effective for domain adaptation.", "conference": 10, "authors": [270, 271, 272], "affiliations": [113, 114], "keys": [467, 468, 62, 469, 470, 41, 471, 472, 334, 347, 473, 474, 349, 475, 317, 476, 477], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2019/tu19_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 85, "fields": {"title": "An Investigation of the Target Approximation Model for Tone Modeling and Recognition in Continuous Mandarin Speech", "abstract": "The complex f", "conference": 11, "authors": [273, 274, 275, 276, 277], "affiliations": [115, 116], "keys": [478, 24, 227, 355, 479, 480, 481], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2020/gao20c_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 86, "fields": {"title": "What the Future Brings: Investigating the Impact of Lookahead for Incremental Neural TTS", "abstract": "In incremental text to speech synthesis (iTTS), the synthesizer produces\nan audio output before it has access to the entire input sentence.\nIn this paper, we study the behavior of a neural sequence-to-sequence\nTTS system when used in an incremental mode, i.e. when generating speech\noutput for token n, the system has access to  n+k tokens from the text\nsequence. We first analyze the impact of this incremental policy on\nthe evolution of the encoder representations of token n for different\nvalues of k (the lookahead parameter). The results show that, on average,\ntokens travel 88% of the way to their full context representation with\na one-word lookahead and 94% after 2 words. We then investigate which\ntext features are the most influential on the evolution towards the\nfinal representation using a random forest analysis. The results show\nthat the most salient factors are related to token length. We finally\nevaluate the effects of lookahead k at the decoder level, using a MUSHRA\nlistening test. This test shows results that contrast with the above\nhigh figures: speech synthesis quality obtained with 2 word-lookahead\nis significantly lower than the one obtained with the full sentence.", "conference": 11, "authors": [278, 279, 280, 156], "affiliations": [117], "keys": [482, 261, 55, 226, 483, 484, 485, 186, 486], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2020/stephenson20_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 87, "fields": {"title": "On the Robustness and Training Dynamics of Raw Waveform Models", "abstract": "We investigate the robustness and training dynamics of raw waveform\nacoustic models for automatic speech recognition (ASR). It is known\nthat the first layer of such models learn a set of filters, performing\na form of time-frequency analysis. This layer is liable to be under-trained\nowing to gradient vanishing, which can negatively affect the network\nperformance. Through a set of experiments on TIMIT, Aurora-4 and WSJ\ndatasets, we investigate the training dynamics of the first layer by\nmeasuring the evolution of its average frequency response over different\nepochs. We demonstrate that the network efficiently learns an optimal\nset of filters with a high spectral resolution and the dynamics of\nthe first layer highly correlates with the dynamics of the cross entropy\n(CE) loss and word error rate (WER). In addition, we study the robustness\nof raw waveform models in both matched and mismatched conditions. The\naccuracy of these models is found to be comparable to, or better than,\ntheir MFCC-based counterparts in matched conditions and notably improved\nby using a better alignment. The role of raw waveform normalisation\nwas also examined and up to 4.3% absolute WER reduction in mismatched\nconditions was achieved.", "conference": 11, "authors": [281, 282, 283], "affiliations": [118], "keys": [487, 204, 488, 72, 489, 490, 491, 492, 206, 30, 207, 92, 294, 337], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2020/loweimi20_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 88, "fields": {"title": "Spoofing Attack Detection Using the Non-Linear Fusion of Sub-Band Classifiers", "abstract": "The threat of spoofing can pose a risk to the reliability of automatic\nspeaker verification. Results from the biannual ASVspoof evaluations\nshow that effective countermeasures demand front-ends designed specifically\nfor the detection of spoofing artefacts. Given the diversity in spoofing\nattacks, ensemble methods are particularly effective. The work in this\npaper shows that a bank of very simple classifiers, each with a front-end\ntuned to the detection of different spoofing attacks and combined at\nthe score level through non-linear fusion, can deliver superior performance\nthan more sophisticated ensemble solutions that rely upon complex neural\nnetwork architectures. Our comparatively simple approach outperforms\nall but 2 of the 48 systems submitted to the logical access condition\nof the most recent ASVspoof 2019 challenge.", "conference": 11, "authors": [284, 285, 286, 287, 288], "affiliations": [119], "keys": [493, 494, 495], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2020/tak20_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 89, "fields": {"title": "Classification of Manifest Huntington Disease Using Vowel Distortion Measures", "abstract": "Huntington disease (HD) is a fatal autosomal dominant neurocognitive\ndisorder that causes cognitive disturbances, neuropsychiatric symptoms,\nand impaired motor abilities (e.g., gait, speech, voice). Due to its\nprogressive nature, HD treatment requires ongoing clinical monitoring\nof symptoms. Individuals with the Huntington gene mutation, which causes\nHD, may exhibit a range of speech symptoms as they progress from premanifest\nto manifest HD. Speech-based passive monitoring has the potential to\naugment clinical information by more continuously tracking manifestation\nsymptoms. Differentiating between premanifest and manifest HD is an\nimportant yet understudied problem, as this distinction marks the need\nfor increased treatment. In this work we present the first demonstration\nof how changes in speech can be measured to differentiate between premanifest\nand manifest HD. To do so, we focus on one speech symptom of HD: distorted\nvowels. We introduce a set of Filtered Vowel Distortion Measures (FVDM)\nwhich we extract from read speech. We show that FVDM, coupled with\nfeatures from existing literature, can differentiate between premanifest\nand manifest HD with 80% accuracy.", "conference": 11, "authors": [289, 290, 291, 292, 172], "affiliations": [79, 120], "keys": [496, 497, 2, 498, 499, 500, 501, 129], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2020/romana20_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 90, "fields": {"title": "TMT: A Transformer-Based Modal Translator for Improving Multimodal Sequence Representations in Audio Visual Scene-Aware Dialog", "abstract": "Audio Visual Scene-aware Dialog (AVSD) is a task to generate responses\nwhen discussing about a given video. The previous state-of-the-art\nmodel shows superior performance for this task using Transformer-based\narchitecture. However, there remain some limitations in learning better\nrepresentation of modalities. Inspired by Neural Machine Translation\n(NMT), we propose the Transformer-based Modal Translator (TMT) to learn\nthe representations of the source modal sequence by translating the\nsource modal sequence to the related target modal sequence in a supervised\nmanner. Based on Multimodal Transformer Networks (MTN), we apply TMT\nto video and dialog, proposing MTN-TMT for the video-grounded dialog\nsystem. On the AVSD track of the Dialog System Technology Challenge\n7, MTN-TMT outperforms the MTN and other submission models in both\nVideo and Text task and Text Only task. Compared with MTN, MTN-TMT\nimproves all metrics, especially, achieving relative improvement up\nto 14.1% on CIDEr.", "conference": 11, "authors": [293, 294, 295, 296], "affiliations": [], "keys": [502, 503, 504, 505, 506, 457, 101, 493, 507, 508, 509, 510, 511], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2020/li20ea_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 91, "fields": {"title": "Towards One Model to Rule All: Multilingual Strategy for Dialectal Code-Switching Arabic ASR", "abstract": "With the advent of globalization, there is an increasing demand for\nmultilingual automatic speech recognition (ASR), handling language\nand dialectal variation of spoken content. Recent studies show its\nefficacy over monolingual systems. In this study, we design a large\nmultilingual end-to-end ASR using self-attention based conformer architecture.\nWe trained the system using Arabic (Ar), English (En) and French (Fr)\nlanguages. We evaluate the system performance handling: (i) monolingual\n(Ar, En and Fr); (ii) multi-dialectal (Modern Standard Arabic, along\nwith dialectal variation such as Egyptian and Moroccan); (iii) code-switching\n— cross-lingual (Ar-En/Fr) and dialectal (MSA-Egyptian dialect)\ntest cases, and compare with current state-of-the-art systems. Furthermore,\nwe investigate the influence of different embedding/character representations\nincluding character vs word-piece; shared vs distinct input symbol\nper language. Our findings demonstrate the strength of such a model\nby outperforming state-of-the-art monolingual dialectal Arabic and\ncode-switching Arabic ASR.", "conference": 12, "authors": [297, 298, 299, 300], "affiliations": [121, 122], "keys": [72, 24, 512, 513, 2, 514, 493, 515, 516, 517, 518], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/chowdhury21_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 92, "fields": {"title": "Tied & Reduced RNN-T Decoder", "abstract": "Previous works on the Recurrent Neural Network-Transducer (RNN-T) models\nhave shown that, under some conditions, it is possible to simplify\nits prediction network with little or no loss in recognition accuracy\n[1, 2, 3]. This is done by limiting the context size of previous labels\nand/or using a simpler architecture for its layers instead of LSTMs.\nThe benefits of such changes include reduction in model size, faster\ninference and power savings, which are all useful for on-device applications.", "conference": 12, "authors": [301, 302, 303, 304, 305, 306], "affiliations": [123], "keys": [519, 520, 24, 2, 245, 365, 521, 311, 522, 523], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/botros21_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 93, "fields": {"title": "Image-Based Assessment of Jaw Parameters and Jaw Kinematics for Articulatory Simulation: Preliminary Results", "abstract": "Correcting the deficits in jaw movements have often been ignored in\nassessment and treatment of speech disorders. A robotic simulation\nis being developed to facilitate Speech Language Pathologists to demonstrate\nthe movement of jaw, tongue and teeth during production of speech sounds,\nas a part of a larger study. Profiling of jaw movement is an important\naspect of articulatory simulation. The present study attempts to develop\na simple and efficient technique for deriving the jaw parameters and\nusing them to simulate jaw movements through inverse kinematics.", "conference": 12, "authors": [307, 308, 309, 310], "affiliations": [], "keys": [524, 525, 526, 527, 528, 138], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/abraham21_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 94, "fields": {"title": "Leveraging Real-Time MRI for Illuminating Linguistic Velum Action", "abstract": "Velum actions are critical to differentiating oral and nasal sounds\nin spoken language; specifically in the latter, the velum is lowered\nto open the nasal port and allow nasal airflow. However, details on\nhow the velum is lowered for nasal production in speech are scarce.\nState-of-the-art real-time Magnetic Resonance Imaging (rtMRI) can directly\nimage the entirety of the moving vocal tract, providing spatiotemporal\nkinematic data of articulatory actions. Most instrumental studies of\nspeech production explore oral constriction actions such as lip or\ntongue movements. RtMRI makes possible a quantitative assessment of\nnon-oral and non-constriction actions, such as velum (and larynx) dynamics.\nThis paper illustrates articulatory aspects of consonant nasality,\nwhich have previously been inferred from acoustic or aerodynamic data.\nVelum actions are quantified in spatial and temporal domains: i) vertical\nand horizontal velum positions during nasal consonant production are\nquantified to measure, respectively, the degree of velum lowering and\nvelic opening, and ii) duration intervals for velum lowering, plateau,\nand raising are obtained to understand which portion of the velum action\nis lengthened to generate phonologically long nasality. Findings demonstrate\nthat velum action tracking using rtMRI can illuminate linguistic modulations\nof nasality strength and length.", "conference": 12, "authors": [311, 312, 10], "affiliations": [3], "keys": [529, 15, 530, 531, 17, 206, 341, 532, 533, 161, 19, 534, 535], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/oh21b_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 95, "fields": {"title": "Ethical and Technological Challenges of Conversational AI", "abstract": "Conversational AI (ConvAI) systems have applications ranging from personal\nassistance, health assistance to customer services. They have been\nin place since the first call centre agent went live in the late 1990s.\nMore recently, smart speakers and smartphones are powered with conversational\nAI with similar architecture as those from the 90s. On the other hand,\nresearch on ConvAI systems has made leaps and bounds in recent years\nwith sequence-to-sequence, generation-based models. Thanks to the advent\nof large scale pre-trained language models, state-of-the-art ConvAI\nsystems can generate surprisingly human-like responses to user queries\nin open domain conversations, known as chit-chat. However, these generation\nbased ConvAI systems are difficult to control and can lead to inappropriate,\nbiased and sometimes even toxic responses. In addition, unlike previous\nmodular conversational AI systems, it is also challenging to incorporate\nexternal knowledge into these models for task-oriented dialog scenarios\nsuch as personal assistance and customer services, and to maintain\nconsistency.", "conference": 12, "authors": [313], "affiliations": [], "keys": [], "url": "https://www.isca-speech.org/archive/interspeech_2021/fung21_interspeech.html"}}, {"model": "ver0.paper", "pk": 96, "fields": {"title": "Reinforcement Learning for Emotional Text-to-Speech Synthesis with Improved Emotion Discriminability", "abstract": "Emotional text-to-speech synthesis (ETTS) has seen much progress in\nrecent years. However, the generated voice is often not perceptually\nidentifiable by its intended emotion category. To address this problem,\nwe propose a new interactive training paradigm for ETTS, denoted as", "conference": 12, "authors": [314, 315, 24], "affiliations": [124, 125, 126], "keys": [536, 24, 55, 537, 538, 539, 540], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/liu21p_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 97, "fields": {"title": "Non-Intrusive Speech Quality Assessment with Transfer Learning and Subject-Specific Scaling", "abstract": "In communication systems, it is crucial to estimate the perceived quality\nof audio and speech. The industrial standards for many years have been\nPESQ, 3QUEST, and POLQA, which are intrusive methods. This restricts\nthe possibilities of using these metrics in real-world conditions,\nwhere we might not have access to the clean reference signal. In this\nwork, we develop a new non-intrusive metric based on crowd-sourced\ndata. We build a new speech dataset by combining publicly available\nspeech, noises, and reverberations. Then we follow the ITU P.808 recommendation\nto label the dataset with mean opinion scores (MOS). Finally, we train\na deep neural network to estimate the MOS from the speech data in a\nnon-intrusive way. We propose two novelties in our work. First, we\nexplore transfer learning by pre-training a model using a larger set\nof POLQA scores and finetuning with the smaller (and thus cheaper)\nhuman-labeled set. Secondly, we perform a subject-specific scaling\nin the MOS scores to adjust for their different subjective scales.\nOur model yields better accuracy than PESQ, POLQA, and other non-intrusive\nmethods when evaluated on the independent VCTK test set. We also report\nmisleading POLQA scores for reverberant speech.", "conference": 12, "authors": [316, 317, 318, 319], "affiliations": [127, 128], "keys": [541, 542, 543, 287, 457, 544, 282, 193, 545, 429, 288, 198], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/nessler21_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 98, "fields": {"title": "Voicing Assimilations by French Speakers of German in Stop-Fricative Sequences", "abstract": "Voicing assimilations inside groups of obstruents occur in opposite\ndirections in French and German, where they are respectively regressive\nand progressive. The aim of the study is to investigate (1) whether\nnon native speakers (here French learners of German) are apt to acquire\nsubtle L2 specificities like assimilation direction, although they\nare not aware of their very existence, or (2) whether their productions\ndepend essentially upon other factors, in particular consonant place\nof articulation. To that purpose, a corpus made up of groups of obstruents\n(/t/ followed by /z/, /v/ or /f/) embedded into sentences has been\nrecorded by 16 French learners of German (beginners and advanced speakers).\nThe consonants are separated by a word or a syllable boundary. Results,\nderived from the analysis of consonant periodicity and duration, do\nnot stand for an acquisition of progressive assimilation, even by advanced\nspeakers, and do not show differences between the productions of advanced\nspeakers and beginners. On the contrary the boundary type and the consonant\nplace of articulation play an important role in the presence or absence\nof voicing inside obstruent groups. The role of phonetic, universal\nmechanisms against linguistic specific rules is discussed to interpret\nthe data.", "conference": 12, "authors": [320], "affiliations": [129], "keys": [496, 546, 547, 7, 548, 549, 550, 551], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/bonneau21_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 99, "fields": {"title": "End-to-End Language Diarization for Bilingual Code-Switching Speech", "abstract": "We propose two end-to-end neural configurations for language diarization\non bilingual code-switching speech. The first, a BLSTM-E2E architecture,\nincludes a set of stacked bidirectional LSTMs to compute embeddings\nand incorporates the deep clustering loss to enforce grouping of languages\nbelonging to the same class. The second, an XSA-E2E architecture, is\nbased on an x-vector model followed by a self-attention encoder. The\nformer encodes frame-level features into segment-level embeddings while\nthe latter considers all those embeddings to generate a sequence of\nsegment-level language labels. We evaluated the proposed methods on\nthe dataset obtained from the shared task B in WSTCSMC 2020 and our\nhandcrafted simulated data from the SEAME dataset. Experimental results\nshow that our proposed XSA-E2E architecture achieved a relative improvement\nof 12.1% in equal error rate and a 7.4% relative improvement on accuracy\ncompared with the baseline algorithm in the WSTCSMC 2020 dataset. Our\nproposed XSA-E2E architecture achieved an accuracy of 89.84% with a\nbaseline of 85.60% on the simulated data derived from the SEAME dataset.", "conference": 12, "authors": [321, 322, 323, 324, 325, 221, 326], "affiliations": [112, 130], "keys": [552, 245, 553, 554, 365, 555, 556, 557, 558, 559, 388, 560, 512, 513, 561, 562, 563, 515, 564], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/liu21d_interspeech.pdf"}}, {"model": "ver0.paper", "pk": 100, "fields": {"title": "The LF Model in the Frequency Domain for Glottal Airflow Modelling Without Aliasing Distortion", "abstract": "Many of the commonly used voice source models are based on piecewise\nelementary functions defined in the time domain. The discrete-time\nimplementation of such models generally causes aliasing distortion,\nwhich make them less useful for certain applications. This paper presents\na method which eliminates this distortion. The key component of the\nproposed method is the frequency domain description of the source model.\nBy deploying the Laplace transform and phasor arithmetic, closed-form\nexpressions of the source model spectrum can be derived. This facilitates\nthe calculation of the spectrum directly from the model parameters,\nwhich in turn makes it possible to obtain the ideal discrete spectrum\nof the model given the sampling frequency used. This discrete spectrum\nis entirely free of aliasing distortion, and the inverse discrete Fourier\ntransform is used to compute the sampled glottal flow pulse. The proposed\nmethod was applied to the widely used LF model, and the complete Laplace\ntransform of the model is presented. Also included are closed-form\nexpressions of the amplitude spectrum and the phase spectrum for the\ncalculation of the LF model spectrum.", "conference": 12, "authors": [327], "affiliations": [131, 132], "keys": [565, 566, 567, 334, 568, 569, 570, 571, 572], "url": "https://www.isca-speech.org/archive/pdfs/interspeech_2021/gobl21_interspeech.pdf"}}]